[
  {
    "path": "notes/2021-07-20-council20210719/",
    "title": "Town Council 2021-07-19",
    "description": "The (virtual) room where it happened",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2021-07-20",
    "categories": [
      "notes"
    ],
    "contents": "\nDanielle Glaros presented on storm water projects:\nPG county has challenging topography for flooding because:\nPoor drainage\nLow lying\nWaterways everywhere\nBecause of this, PG county has stronger storm water management than the state of MD requires. Essentially every new development needs to control 100% of the run off. The MD standard is 50%. However, older developments have zero storm water management.\nOne interesting nugget was that because of these strong regulations new developments reduce the amount of run-off downstream.\nUP has two waterways:\nWells Run\nGuilford Run\n\nShe focused mostly on Wells Run. The 9 Ponds project will likely start within 6 months. Will take about a year to complete. Will be a pond with a path around it. Goal is to make a desireable amenity. Unfortunately trees will be removed to make the pond (designed to retain as many as possible and to replant new ones). The creek upstream of the pond will also be cleaned up to improved flow. Half of water than runs through UP / Wells comes from the PG Mall.Hopefully this will have a large impact for UP.\n\nGuilford Run has some storm water drain work to be done downstream of UP (east of Baltimore).\nMs. Glaros emphasized that water management needed to be managed where it was created. There are no magic bullets. We have to work to control the water we have with rain gardens, reducing impervious surfaces, etc.\nShe is introducing legislation to increase the amount of money the county will reimburse for on-property water control (rain barrels, rain gardens, pervious pavers, etc.).\nAmerican Rescue Plan\nThe town of UP will receive approximately $2.1 million from the US Government over the next two years. The first million will be received very soon. While this is free money it has restrictions on how it can be spent. Very briefly, it can be spent on climate change mitigation (storm water), broadband investments (internet), and COVID-19 mitigation (food banks / small business loans). The town (and committees) are still formulating how the money will be spent. Most of the money will likely go to storm water mitigation. The mayor of UP is looking into hiring a consultant to make a comprehensive Wells Run Watershed (which includes Hyattsville, UP, and Riverdale Park) storm water management plan. The money must be allocated for a project by 12/31/2024 and spent by 12/31/2026.\nWe bought a garage\nThe town of UP is buying the garage that we have leased for the past 11 years. Why? Three reasons:\nThe owner is selling it\nWe are unable to find an equivalent garage within a 20 minute (or even longer….) drive. Much effort was spent trying to “share” garage space with neighboring towns with little effect. The town is a touch salty because we thought we had a deal with Hyattsville….then the terms were changed.\nWe need a garage to fix and store our town equipment (there is a reason you don’t see garbage trucks parked at town hall….)\nThe town administrator (David Deutsch) and the town lawyer (Suellen Ferguson) have been negotiating for months. We have a deal at $825,000. $450,000 was allocated in the last budget for this expense. The remainder will be paid using American Rescue Plan funds, as apparently this is an allowed use of the money.\nThis is good news because:\nWe control a very important piece of infrastructure (a medium-sized garage) that is getting increasingly difficult to procure with the continuous development in the area. We literally were unable to find another equivalent garage (size / location / cost) for lease or sale.\nWe paid “cash” for it and this now frees up about $42,000 / year for the town that was going to the lease.\nWe can always sell it should our needs change\nOur inspections reveal no pollution or structural issues, aside from a leaking roof\nTown Head Notes\nAndrea (town clerk) would really like more town residents to sign up for relevant alerts (e.g. “News and Announcement”). I wrote why you should sign up here.\nDan (Treasurer) briefly summarized the 2020 spending (fiscal year ended 6/31).\nMickey (Public Works) said that the two storm water mini projects (permeable paving at 44th (?) and a rain garden at Claggett/College Heights) were looking great because either one would be enough to meet our PG County requirements. We could save money by doing one or do both and bank extra storm water credits.\nChief Baker had no crime to report. Thanks were given for the UP Town Police’s (and Park Police with their horses) role in the July 4th parade.\n\n\n\n",
    "preview": "notes/2021-07-20-council20210719/glaros_screenshot1.png",
    "last_modified": "2021-07-20T11:43:38-04:00",
    "input_file": {}
  },
  {
    "path": "notes/2021-07-07-council20210706/",
    "title": "Town Council 2021-07-06",
    "description": "The (virtual) room where it happened",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2021-07-07",
    "categories": [],
    "contents": "\nIncomplete, possibly inaccurate notes on what happened. Not official.\nGas blower ban: Continuation (delay) for 2 months for the Policy, Rules & Municipal Structure Committee to make some changes. At the September 7th Town Council meeting the ordinance will (likely) come up for a vote. If you care about improving the ordinance, I suggest you attend the August 5th Policy, Rules & Municipal Structure Committee meeting.\nI will be serving on the Public Facilities and Services Committee (e.g. town hall renovation) and the Police, Traffic and Public Safety Committee.\nLoretta Vitale Saks was formally honored for her role in establishing and running the Helping Hands University Park special committee. Linda Verrill will take over as chair of the committee, as Ms. Saks will be leaving UP soon.\n\nThe “Infrastructure 2B” walk through was briefly discussed by myself. New sidewalks being added on College Heights Dr, Clagett, Claggett-Pineway (and other roads off of College Heights Dr). Notably the roads will be narrowed to 26 ft. While not ideal, sidewalks will generally be right next to the road to reduce the number of utility poles that need to be moved and to protect mature trees. While not discussed the “far” side of Clagett-Pineway (closer to College Heights Dr) will likely be narrowed to 24 ft and parking removed from one side to reduce the amount of yard that will be taken, as this portion of Claggett-Pineway is already 26 ft.\nThe town will be hosting the first “Meadow Day” on July 24th!\n\n\n\n",
    "preview": "notes/2021-07-07-council20210706/saks.png",
    "last_modified": "2021-07-07T11:27:20-04:00",
    "input_file": {}
  },
  {
    "path": "notes/2021-05-20-signingup/",
    "title": "Hot off the press",
    "description": "Or how to influence the process",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2021-06-07",
    "categories": [
      "notes"
    ],
    "contents": "\nOur Town Clerk is Andrea. She told me she was hoping more town residents would sign up on the web page to get updates. I think she is right. Why should you? After all, the town writes and prints a newsletter that comes to your mailbox!\nWell - one important reason: time. The newsletter comes out once a month. Minutes of the town meetings that go into the newsletter have to be approved by the council. Then meet the printing cutoff. So essentially you are reading minutes (“what happened in the room”) that are 4-8 weeks old.\nIf you want to get council matter updates MUCH faster you can go here: https://www.upmd.org/list.aspx\nI suggest you sign up for the “Mayor’s Email List” as Mayor Carey generally sends out a Friday-before-the-Monday-Council-Meeting message that briefly covers what will be discussed at the upcoming meeting. There is always a public comment period near the start of the meeting (7:30 pm) to allow residents to have up to 3 minutes to give their opinion.\n\nIf you have more specific interests (for example “trees”) - you can sign up for Agenda updates for a specific committee like the “Trees, Parks, & Environment Committee”.\n If you want to influence legislation the best time to do it is at the Committee level. By the time a piece of legislation has made its way to the full Town Council the specific committee generally believes it is ready to be approved (otherwise why bother bringing it out?). So thus raising issues before it gets to the full Town Council will be more effective.\nRemember, all council meetings (either Committee or Council) are open to the public. You do not need to ask permission to show up. Depending on the specific Committee you can either take part in the full discussion or will be limited to speaking in the “public comment” portion of the meeting.\n\n\n\n",
    "preview": "notes/2021-05-20-signingup/mayor_list.png",
    "last_modified": "2021-06-07T17:50:11-04:00",
    "input_file": {}
  },
  {
    "path": "notes/2021-05-19-wheresthebridge/",
    "title": "Where's that bridge?",
    "description": "A sad story",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2021-05-19",
    "categories": [
      "notes"
    ],
    "contents": "\n2021-06-07\nHad a brief discussion with Mickey Beall (UP public works director).\nHere are my notes from our chat:\nThere is a new idea how to save money on the install (essentially drill a support instead of pouring a large foundation). But this would maybe save approximately $10,000 of the appoximately $100,000 install cost that we were last quoted. We also would have to restart the permitting process. It wouldn’t be as onerous this time. But still would take more time.\nAny new bridge has to be ADA compliant - so we can’t toss a narrow anything down.\nWe also can’t toss a bridge down like they do in the College Park metal dry ditch pedestrian bridges. Those would lift up and float away if it flooded. Which we know if a fairly likely scenario on Wells. Plus a stream with running water is a substantially more challenging environment for a bridge.\nLonger bridge won’t solve the problem either. The bridge would cost more and the installation cost would not change dramatically.\nBottom line: Mickey has spent 4+ years working on this and believes he has exhausted all angles. The cost is the cost. Essentially the council needs to decide: are these bridge(s) worth 100k each? Do we, as a town, find that a prudent use of our money? Is this something we value? Let me know what you think.\nOriginal post\nBrief stub to explain the current state of the Van Buren / Wells Parkway Pedestrian Bridge. Which Google Maps thinks is doing just fine.\n\nFrom my faulty memory, around 2016 it was pointed out that this bridge was in bad shape. This was confirmed by engineers. In fact, it was in such bad shape there was concern it could collapse. Thus, it was removed.\nPeriodically people (like me) ask “uh, where’s the replacement bridge?”\nHere, I will explain what I understand about this annoying situation.\nThe town bought two wooden bridges. We have them on hand.\nPermitting was required at three levels (Federal, State, and County). The latter was extremely challenging (apparently the bridges were missed in the 1990s era PG County Master Plan).\nAfter huge amounts of town staff time dealing with the three layers of permitting, the town bid the bridge install out. It came out substantially higher (around $110,000) than expected. The council, twice, voted it down.\nSo the bridge replacement process is currently … in bad shape. Maybe even dead.\nPart of the reason that the install was so expensive was the extensive amount of work required to not cause sediment and erosion issues in the stream bed.\nWith all we have learned, we may have to restart the entire process (including the part where we buy some bridges). A longer / larger bridge may cost more, but could save money on the install cost.\n\n\n\n",
    "preview": "notes/2021-05-19-wheresthebridge/google_maps_wells.png",
    "last_modified": "2021-06-07T16:36:10-04:00",
    "input_file": {}
  },
  {
    "path": "notes/2021-05-05-upmd-website-content/",
    "title": "UP Website Content",
    "description": "How to benefit from the UP website content",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2021-05-05",
    "categories": [
      "notes"
    ],
    "contents": "\nThe upmd.org web page is a great resource for getting a wide variety of town info. There is an extensive amount of public discourse about what the town is doing, will do, and would like to do. This happens at the town meetings.\nImportantly, the notes for the meetings are TEXT SEARCHABLE.\nThe town meetings are of two basic types: town council (1st and 3rd Mondays of each month, beginning at 7:30pm) and committees (each with their own schedule, often monthly). All of these meetings are fully open to the public and as of May 2021 are held exclusively via zoom teleconference.\nA case study\nTo give an example of how to search the town web page to find information on what the town is doing, we will search the term “storm water.”\n\n In the search box you can put in a word or phrase (“storm water”). Then click the magnifying glass (or hit “return” on the keyboard) and you will get the time sorted results, split by section (where section is the specific committee or the town council).\n We see the top three hits (by date) are in the Town Council Meeting and the Development Overview Committee. You can then download either the Agenda (what will be discussed) or the Minutes (a summary of what was discussed).\nIf we download the Mar 11, 2021 minutes we see that the “Aspen, College Park” development has a preliminary plan of subdivision that has been approved and “Nick Speech talked about the re-engineering of the project’s stormwater handling. The County will not accept a fee in-lieu for stormwater management. They have included vaults to hold stormwater under each of the 2 buildings…”\n\n\n\n",
    "preview": "notes/2021-05-05-upmd-website-content/upmd_page.png",
    "last_modified": "2021-05-06T10:00:50-04:00",
    "input_file": {}
  }
]
