[
  {
    "path": "notes/2023-02-08-2023-02-08-town-council-update/",
    "title": "2023-02-23-Town-Council",
    "description": "February Update",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2023-02-23",
    "categories": [],
    "contents": "\n2023 02 06 Town Council Meeting\nVeoRide presentation from Jeff Hoover (“Director of Government Partnerships”). Fixing parking zones. There are issues with town borders as the scooter auto-deactivates and the only “linking area” is the NE edge of town (where UP borders College Park). None of Hyattsville or Riverdale is a VeoRide area. Forced parking zones are now live. Jeff says that the GPS/photo enforcement is about 90% effective. Mickey Beall says that before the geofencing was on, the parking compliance was well under 50%.\nScooter contact: hello@veoride.com (optionally jhoover@veoride.com)\n2023 02 08 Public Safety Sub-Committee\nChief Baker: If you collect tag/description/behavior of unsafe driving the police will run the tag and send a warning letter to the address listed.\n2023 02 21 Town Council\nCongressman Glenn Ivey’s representative (Ethan Sweep) appeared - gave email if you have any concerns: ethan.sweep@mail.house.gov\nLots of back and forth about whether to get a ~$5000/year issue tracking software (SeeClickFix) for the town - was tabled for two weeks to look into more options. Most of the concern over the cost. From my perspective, this is worth spending as the town has no issue tracking system beyond what the Mayor and DPW can hold in their head. The Police do have their own issue tracking system.\nThe Council formally requested adding stop signs to Wells Parkway at Van Buren. The Chief was concerned as car speeds were fairly high because Wells has few cross streets and there is regular foot traffic to and from the schools in this area.\nTown Clerk\nThe town needs another supervisor of election: Contact TC Hegeman (thegeman@upmd.org, 301-927-4262, ext. 101 ) if you are interested.\nPolice\nChief Baker reports MORE CHECKS STOLEN - stop using the blue boxes.\nOn the 6900 block of Pineway a vehicle stolen. The keys were in the car. Not mine, thank goodness. Please lock your doors.\nThe Chief is looking to hire another crossing guard as one of them is taking leave for health reasons.\nThe UP Police are now using body cameras\nDirector of Public Works (Beall):\n2/14: Tot lot demo began\nSaved a huge elm that was in danger of damage from WSSC gas pipe\nTemporary speed hump moved to Van Buren (West of Wells)\nMr. Dubayah and myself asked Mr. Beall (whose town vehicle is the first UP plug in electric vehicle) whether he could start tracking electric miles (as he does track mileage for the Public Works fleet). He reported going 720 miles on one tank a gas in the vehicle and that 80% of those miles were on electric.\nPineway Speed Humps\nThe temporary humps are to be replaced with permanent ones. Two residents on South Pineway asked whether the permanent speed hump could be moved closer to the entrance at South Pineway / Baltimore to encourage drivers to enter the road more gently. Both the Mayor and Mr. Beall are supportive of this change and I believe a reasonable alteration has been agreed upon.\n\n\n\n",
    "preview": {},
    "last_modified": "2023-02-23T21:25:22-05:00",
    "input_file": {}
  },
  {
    "path": "notes/2022-12-19-2022-12-20-town-council/",
    "title": "2023-01-03-Town-Council",
    "description": "Happy New Year!",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2023-01-08",
    "categories": [],
    "contents": "\nStormwater\nRKK / town finally sent over their town-wide stormwater project ideas. Again - this is different than the “Soltesz” design which is being used to get the county to “accept” our updated stormwater system changes.\nMost pertinent to Ward 5 is the “empty lot” next to my house, at 6922 Pineway. The engineers were surprisingly interested in turning the empty lot into a “dry pond” to help retain excess water. This would require two things: 1. the town deciding to do it (at a proposed construction cost of approximately $350,000) 2. the town purchasing the lot from the private owner (at who knows what cost - but it was last purchased for about $150,000)\nI asked the engineers whether they thought this dry pond would be helpful for our ward or whether it would mostly help Guilford Run / College Park. They said the pipe improvements upstream (Clagett-Pineway) would increase the flow of water and the dry pond would help in intense storm situations. They are also working on the “Calvert Hills” project downstream of us and said they think it would, holistically, be a good project for the area. Mickey said he would verbally discuss it with the county and see whether they would potentially also pay for this project with the existing Soltesz/stormwater acceptance program. RKK engineers said they thought that College Park would be interested in partnering on this. Interesting, but that is a lot of maybe.\nIn general the stormwater improvements that RKK proposed can be binned into a two categories:\nNew inlets and expanded pipes (move water into stormwater pipes more efficiently)\nBioretention areas (“dry ponds” in certain areas)\nI was hoping for a bit more stormwater “holding.” I spoke with Mickey about this and the answer is fairly simple: there are no easy places that the town controls to put water. Most of the park already fills with water during intense downpours. Mickey thought that the only way to substantially hold more water was for all homeowners to install more rain gardens. So perhaps that is something that the town / a committee needs to look into further.\n2023 Town Election\nIt normally would be May 2nd (the town charter says “First Tuesday in May”), but the town clerk said it was a tough date, as it was the day after a council meeting. Last election (uncontested) she worked 24 hours in two days. It has been set for May 9th, 2023. Ward 5 is up for an election in 2023. I am leaning towards running again. If you are interested in the position I would be happy to speak with you about it. One difference is that there will be a small (if I recall correctly around $2500) stipend for the Councilmember.\nSoltesz Stormwater “Acceptance”\nThis is in regards to the substandard piping / inlets underneath Clagett-Pineway that contributes to the flash flooding.\nThe town has submitted the plan to county. Scheduled date in mid January to discuss whether the county will be amenable to accepting our plan and whether they would be adding the funding for this into next years budget.\nPhase 2B / Clagett-Pineway\nIn progress as all of you have noticed! We will soon have a fairly continuous set of sidewalks from Baltimore -> Pineway -> Claggett-Pineway -> Woodberry -> College Heights.\nTown Administrator Hiring\nStill in progress. The Mayor wrote in December for the January newsletter that “I advertised the position, accepted resumes, conducted interviews, and submitted my nomination to the Council for approval. The Council will vote at the first January meeting, and I look forward to their full support.”\nThe highly abbreviated closed interview session (about 2.5 hours allotted across 5 candidates) happened on December 29th. They were asked identical, pre-selected questions.\nMost of council returned comments (and sometimes rankings) by January 1st. There was no follow on interview session.\nAt a closed session before the 2023-01-03 Town Council Meeting, the Mayor informed us of his preferred candidate and this was discussed. The Mayor withdrew the approval of a Town Administrator from the open meeting agenda after the closed session. No vote was taken to approve any candidate.\nThat is where we stand.\nThe Mayor is in charge of the hiring process and he will determine how it proceeds. There is currently a lot of vagueness on how the hiring process should take place and I would not be surprised if the council, in the future, adds some structure.\nCamera grant\nThe Chief/Town applied for a $100,000 grant to install those fancy surveillance cameras around town. We did not get the grant.\n\n\n\n",
    "preview": {},
    "last_modified": "2023-02-08T10:06:09-05:00",
    "input_file": {}
  },
  {
    "path": "notes/2022-12-18-2022-12-18-town-council/",
    "title": "2022-12-18-Town-Council",
    "description": "Last 2022 Update",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2022-12-18",
    "categories": [],
    "contents": "\nFree as in beer\nIn case you were not aware, the town is providing free EV charging at UPES. Why? Let me explain.\nThe charger hardware was free (literally free)\nThe town did have to pay to upgrade the electrical infrastructure to support the chargers\nSo there was not huge outlay of money to provide the chargers at UPES.\nWe are not charging for the electricity for the following reasons:\nIt is not a noticeable amount of cost to the town*\nWe generate a lot of power from the solar panels at UPES - so it may cost the town even less than I estimate below\nThe chargers encourage EV adoption (residents have stated they felt more comfortable buying an EV as they knew they had somewhere safe and convenient to charge)\nCharging for charging costs money (administrative overhead, setting up a payment system, credit card fees, etc)\nThat said, if the cost becomes an issue, we can re-visit the payment question.\n* Napkin math. Pepco charges my house about $0.15 for 1 kWh. One charger outputs around* 4 kW per hour. So 4 * 0.15 ~ $0.60 for one hour of charging. If all eight chargers were in use 24/7/365 this would cost $40,000 a year. Now, that is not the reality. I bike past UPES all the time and the most cars I’ve ever seen charging at a time is about six. Usually 0-1. The town administrator has been asked what this is costing the town and his impression is that this is “not a noticeable amount of money.”\nbased on me looking at some chargers in use\nNew town administrator\nWe don’t have one yet. The town/Mayor is trying to get a new one as quickly as possible to reduce the gap between the outgoing and incoming administrator. Mr. Deutsch, as of 12/16, has retired from his position. He will not stay past that date (we have asked). This was supposed to be a six month job for him, and he is now 2+ years into the position. The position has been advertised and the Mayor will put forward a candidate. The council’s role will be to vote up/down the hiring of the candidate. Interviews are being scheduled with the six or seven candidates. Council members are encouraged to attend the interviews.\nStormwater system update\nThere are two parallel tracks of stormwater planning in town. This is in reference to the “county acceptance” stormwater issue where certain parts of the town’s stormwater system are “substandard” and need to be improved to get the county to assume responsibility. This will, eventually, cost the town about $0. But it involves a lot of paperwork, planning, and inflow of money. The Soltesz firm recently has returned the preliminary plan for the updates, which has be sent to the county to begin to bureaucratic process. It is budget time at the county and we are hoping that the county will put the cost of the program (1.7 million dollars worth) into next year’s budget. Micey has spoken to the county level contacts and they seem (so far) cooperative (as in they don’t seem confused and dismayed at our actions so far).\nThe largest expense, by far, is under Clagett-Pineway. The new system will involve 72 inch diameter pipes (which would be the largest in town) and run the entire length of Clagett-Pineway (currently the system starts at Clagett-Pineway / Clagett).\nClagett-Pineway has flooded several times in the past few years and this flooding has resulted in basement inundation for several Ward 5 residents. The town is fully committed, from the Mayor on down, to updating the system with all haste. We cannot promise that these fixes alone will solve the flash flooding, but this is the first step.\nPolice Requests\nBig one\nThis is a big ask and I would appreciate your comments: Chief Baker wants to place 12 “smart” video cameras at major entry points in town. He is concerned about incidents being caused by non-resident pedestrians. The police have very little information after incidents occur (thankfully most are fairly minor - like package theft) and the county police has no interest in investigating if there isn’t any concrete evidence. UMD and Hyattsville are using similar camera systems.\nThe Chief views the camera system as a police “multiplier” as it will allow for the overnight officers to get automatic alerts if movement is detected and will help in investigating incidents.\nSome details:\nExterior focus (not monitoring “in town” movement)\nData is held on-site in town hall. Deleted after 30 days.\nThere will be a written policy governing usage\nInitial cost: $180,000 (Chief Baker has applied for a $100,000 grant to defray the cost)\nRecurring cost: ~$12,000/year\nPolice will not monitor the video (live or otherwise). The video will only be used in two ways:\nauto-movement alerts at night (so police are aware of unusual activity during the overnight shifts)\nreviewed after a crime has occurred\n\nIf homes are in view of the cameras, the residents will be contacted and offered the option of having a digital “mask” applied over their home.\nI’m of two minds: 1. this will make the police substantially more efficient and more capable to quickly respond to incidents (especially at night) and 2. I’m concerned about the privacy implications. The cameras are essentially placed at all egress points in town and so your movements are being recorded as you leave town. The Chief points out that cameras like these are EVERYWHERE so the panopticon being proposed is already in place all around us. But still, the libertarian in me is a bit uneasy. I am happy to see that the video is being permanently deleted after 30 days - this removes a lot of my imaginary issues.\nTo be clear - this is still in the proposal stage, so there is time to shape the process, if you have concerns.\nSmaller one\nThe next ask is a retention bonus for the officers. This will cost about $40,000 in total. Eligible officers will get up to $5,000. If they accept the bonus they must stay on the UP force for three years (or they have to pay back the bonus). Police staffing is especially difficult and just about every “competing” police force is offering large bonuses. Chief Baker states this is not intended to be a yearly occurence. I plan on supporting this request.\nTreasurer\nDan Baden will be retiring end of this year. We will advertise the position and work on hiring another treasurer. From what I understand we have a separate book-keeper, so regular payment and payroll actions will not be affected.\nCode Compliance\nWe have had a new officer (John Rodgers) for about three months. The outgoing town administrator says he has been doing a good job so far. Remember, if there are any complaints regarding property maintenance, they can be routed to him.\nStay safe and happy holidays!\nPlease consider masking inside - the kids are getting ravaged with various diseases (I think my daughter’s K class was 30% absent last Friday).\n\n\n\n",
    "preview": {},
    "last_modified": "2023-02-08T10:06:09-05:00",
    "input_file": {}
  },
  {
    "path": "notes/2022-10-24-2022-10-25-town-council/",
    "title": "2022-10-25-Town-Council",
    "description": "Happenings",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2022-10-25",
    "categories": [],
    "contents": "\nStormwater\nTwo tracks\nRKK (engineering firm) has been tasked with designing a town wide stormwater management approach. We have been about a month away from seeing the final report for what feels like several months now. Hoping to see this soon! The town suggested a list of 8-10 sites / ideas to spur the process. Overall they were asked to suggest and price solutions which will make the town more resilient to the increasingly violent rain storms which are causing the streams (and streets) to flood.\nUpdate existing systems (Soltesz). The town contains several stormwater system elemetns that are “below standards.” The town is currently working with the Soltesz engineering firm to propose a updates to make all of our town systems up to standard. I’ve been in communication with most of the households in Ward 5 that this work directly effects. The hope is that after we upgrade the pipes underneath Clagett-Pineway we will be better prepared to handle the more frequent 3-inches-in-30-minute microbursts we are getting. This was supposed to be done last week, but has been delayed a bit (hopefully done this week???) due to some COVID in the Soltesz staff.\nTot Lot\nBudget approved. Design finalized. Looks pretty nice I think. Mayor Bierman set up a parent-led committee to help design the new tot lot. The existing equipment will be offered to the University Park Elementary School. This is the design, but not the color scheme.\n\nTown Administrator\nMr. Deutsch let the mayor know he intends to step down by the end of this year. He has offered to help recruit and hire the next administrator to make a smooth transition. I expect (assume? guess?) that Mayor Biermann will lead the search and interview process.\nPhase 2B\nAt the last council meeting the council approved funding changes (had to spend a bit more due to the huge delay in starting this project). Construction may begin in a few months.\nThis will add sidewalks on the south side of Claggett-Pineway. This will narrow the roadway - enough that the “West” portion will switch to one-side only parking.\nDrug take back\nThis Saturday (10/29) at Town Hall.\nPermitting Change\nFor “standard” permits, town council approval is no longer needed. This means permits will be approved on a quicker timeline. Anything requiring a variance will still need council approval.\nHalloween\nThe UP Police are closing many roads this year to encourage walking:\n- Wells Parkway (Chansory)\n- Van Buren (Forest Hill)\n- College Heights (Forest Hill)\n- College Heights (Underwood)\n- Wells Parkway (College Heights)\n\n\n\n",
    "preview": {},
    "last_modified": "2023-02-08T10:06:09-05:00",
    "input_file": {}
  },
  {
    "path": "notes/2022-09-19-2022-09-19-town-council/",
    "title": "2022-09-19-Town-Council",
    "description": "The heat breaks!",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2022-09-19",
    "categories": [],
    "contents": "\nParking Enforcement\nChief Baker desires selective zones for parking permitting. Chief specifically mentioned “North” Pineway near Baltimore Avenue as an area where the police are getting regular complaints. The overall goal is to allow the police to quickly determine which car is owned by a resident and then the police, when they have time, can hand type in plates to see whether they are a resident of UP (no ticket) or not (potential ticket). This would require, at the bare minimum, residents of certain areas to agree to get (and use) new UP parking permits.\nI asked the Chief on how to deal with about contractor visits, friend and family visits, etc. He replied that he imagined that people could just email him beforehand.\nI expressed concern about the inconvenience of having to get permission for visitors. I would assume that if “accidental” tickets get written, it would be fairly easy to get them dismissed.\nPlease send me your thoughts on this - would you mind if you were required to have parking stickers (numbered?) on your vehicles?\nTown Shuttle Survey\nHalf of the household will get a survey very soon. Please fill it out! Even if you don’t know what the shuttle is. Or if you never used it! Ideally everyone would return it. To be clear - this is NOT a referendum on whether the town will restart the shuttle program. But we are trying to figure out what the demand could be and also the general level of support for a shuttle program.\nWard 5 Block Party\nThanks for everyone who came! We had a great time. It wasn’t that hard to organize - so perhaps someone would consider taking up the mantle for next year?\nNew Tot Lot\nAwaiting new design from installer. Expect to see it soon.\nWard 5 Stormwater\nThis is in regard to the below standard stormwater system at Clagett-Pineway/Pineway.\nA town-wide map of the stormwater system can be found here: https://www.princegeorgescountymd.gov/DocumentCenter/View/37140/Muni_Map_Landscape_UNIVERSITY-PARK?bidId=\nOn the urging of dedicated residents of our Ward. I am focused on working with Mr. Beall (Public Works Director), David Deutsch (Town Administrator), and Mayor Biermann on expediting the process for the town to update the stormwater system in this area. This is the rough process (about 18 months):\nTown (actually we contract out to an engineering firm) 30% designs the stormwater update\nTown submits the design to the county\nCounty approves plan and writes us an MOU (memorandum of understanding) that the county will, when the project is done, reimburse the town and take control of the system\nGet to 100% design/permitting. This takes the longest and is negotiated between the county and the contracted engineering firm.\nWe get quotes for the work and secure funding\nBreak ground\nTreasurer Baden\nTrajectory of 2.16 million dollars annual revenue from speeding cameras. Remember, we can only retain up to 10% of town revenue from this pot of money. Crazy numbers, though.\nPublic Works Director Beall\nInstalled and update traffic control at UPES before school started. A programmable beacon. This blinks during school arrival and departure. Town also increased the size of dropoff zone on Underwood. Mickey believes the updates are well received from school, parents, officers, and crossing guards.\nPhase 2B: for us, this is the new sidewalks on Clagett Pineway. This is held up as the county fights with the construction companies on negotiating rates (the town “piggybacks” on these contracts, which save us money as we are not in a good position to negotiate rates on our relatively small road projects). Mickey is hoping to present to council in early October for start in late October.\nTraffic\nThis just a rough sketch - but the Public Safety committee is trying to create a more general framework for addressing problem parts of town. At the last meeting a resident of “West” Van Buren was complaining about high speed traffic. This road was recently used to measure traffic and while the traffic counts were quite low (dozens a day), a huge proportion of the cars were going over 25mph. Some over 40mph. In the short-term we requested the Chief move a blinking speed camera to this road. Medium term, maybe move the temporary speed humps on Pineway and Clagett (when they get replaced with “real” ones soon). Longer term, I still think the town needs a bigger “toolkit” than speed bumps. I am happy that the Chief has purchased movable blinking camera signs. This is a new tool and evidence suggests they are quite effective. We may need to allocate some money to buying more of these. I am a broken record on this and perhaps everyone else is tired of hearing me say it - but I think the town should also consider putting giant concrete obstacles (flower pots or whatever) in the road to force drivers to pay more attention.\nMaybe consequential but I have no idea right now\nApparently Pepco is offering to “sell” the streetlights to the town. Mr. Deutsch will look into whether this makes any sense. I know the Mayor and a few councilmembers were interested in getting LED lights to simultaneously increase lighting on the roads/sidewalks and make it more directional (less light “spilling”). Also, this would reduce the electricity that the town (apparently) pays to run the lights.\n\n\n\n",
    "preview": {},
    "last_modified": "2023-02-08T10:06:09-05:00",
    "input_file": {}
  },
  {
    "path": "notes/2022-07-18-2022-07-18-town-council/",
    "title": "2022-07-18-Town-Council",
    "description": "July update",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2022-07-18",
    "categories": [],
    "contents": "\nNew Mayor and Councilmembers\nJoel Biermann is the new mayor - mayorbiermann@upmd.org\nRalph Dubayah (Ward 1) and Bill Sweet (Ward 7) are new councilmembers.\nChairs have been shuffled a bit on the sub-committees. I am co-chair (with Martha Wells) of the DOC (development), Mary Gathercole is the new chair of the Public Safety Committee, and Nat Morgan is the new chair of the Public Facilities Committee.\nMicroburst Storm (7/12/2022)\nMickey Beall called the Public Works staff in that same night to work with the UP Police to identify and mark downed trees and limbs and immediately began coordinating removal of trees and debris. Public Works staff cleared all debris by the following Monday (July 18).\nAdelphi (Town Administrator Deustch)\nLight timings of pedestrian crossings have been double checked at Toledo and Belcrest.\nThe empty synagogue across the street (near the PG county community center) will be demolished soon (within a month). The county owns the lot and, longer term, is planning on using the space to expand the community center.\nAfter David Deutsch’s persistance, PG County is now considering a “pedestrian island” at the Tennyson/Adelphi intersection (non-signalized crossing). He hadd requested A HAWK signal (big blinking pedestrian-activated light bar that signals cars to stop), but the county does not sound particularly interested. They didn’t say no at this time. These are expensive lights - around $100,000 and the town would likely have to pay for this.\nChief Baker\nNew officer hired 7/14. His name is Peter Shepherd. I think I heard he was a top marksman and swimmer at Hood (?) Academy. One vacancy remains - the Chief is currently reviewing candidates.\nActive shooter training will be conducted at University Park Elementary this summer (August 17th I believe). The Chief is requesting other neighboring police forces participate. High on the list of conversations I did not ever expect to have was a chat I had with Chief Baker after the Uvalde disaster. I told Chief Baker that, should there be an active shooter at UPES, I expect our police officers to respond immediately and push forward without hesitation until the shooter is neutralized. I told the Chief I would support any training necessary to get our police force familiar with the layout and procedures of the school. Chief Baker said he understood and that he and Mr. Deutsch were working on a updated active shooter plan. He reiterated at the July 18th town council meeting that he expects the plan to be done by September, about at the start of the school year.\nTree Ordinance\nA reminder that the UP tree ordinance is in effect - any tree with a circumference over 50 inches at 4.5 feet (multi-stem trees are measured at the same height and have a more complicated formula) needs to have a permit for removal. Of course Mother Nature needs no permit and will aggressively cull trees whenever she feels like it. Contact TC Hegeman thegeman@upmd.org if you need a permit. While this is a new program and the town will have to work out the exact process, the intent is to quickly confirm whether a tree is in poor health. If you have a multi-stem tree, the town will soon (?) provide a calculator of some kind. But in the now-term, please email lmorrissey@upmd.org and karinburghardt@gmail.com with the diameters of the trunks at 4.5 feet if you need clarity.\nPhase 2B\nAfter a long delay, “Phase 2B” of the town road/sidewalk improvement project will resume. In Ward 5, sidewalks are to be added to the south side of Clagett-Pineway, a rain garden (which replaces some extraneous road) will be installed at Woodberry / College Heights, and the temporary speed bumps on Pineway will be replaced with permanent ones. This work is expected to start in September/October. The permit for this work was just issued on Friday, July 15th. A major issue is that the cost for this last slice of the town infrastructure improvement have gone up substantially. The town is still awaiting the final costs as the contract is being re-negotiated. The town “piggybacks” on a contract that the county negotiates with the contractor (Soltesz / NZI I believe). Once this finishes, the town will be (for the near future) done altering the sidewalks/roads in town.\nWho do I email if I need a thing?\nA reminder:\nIs it permit related? TC Hegeman thegeman@upmd.org\nIs it related to public works / trash / town trees / overgrown foliage near-ish to public areas? Michael Beall mbeall@upmd.org\nIs a traffic light or pedestrian crossing not working or is weird? David Deutsch ddeutsch@upmd.org\nDo you have no idea? David Deutsch ddeutsch@upmd.org and/or myself (David McGaughey dmcgaughey@upmd.org)\nOther stuff in the short/medium term David headspace\nTown stormwater plan (awaiting report from contractor - should get something in the next few months). This would use most of the remaining “ARPA” (free federal money) funds.\nTown hall update (awaiting bids/proposals on a fairly modest plan - a temporary (?) office/building that can double as meeting rooms / employee break room, dry storage for public works in town, chargers for electric vehicles)\nTown Transit (shuttle) Task Force II - survey to gauge usage/interest will likely go out in September. Mr. Deutsch just received a preliminary quote - an electrified F350 12-person shuttle would be around $96,420. Ms. Verrill has nearly finished designing the survey the task force wrote. The council has seen a draft and didn’t have any substantial changes. It will be mailed to about half the households across town. Why half? Well to make a modest attempt at preventing any interested group in “stuffing” the ballot box, it was decided to randomly select households to receive a survey. The survey is NOT a referendum, but merely another data point. Please email your councilmember your opinion.\nTown garage improvements (roof replacement, redesign some interior space to make more useful)\nDOC - some short discussion about having the committee write a white paper that would lay out medium/long term thoughts on how the town could change (or not) as development (much of it higher density) grows around us. The appearance of the town at the borders (Baltimore / EW Highway / Adelphi) weighs heavily on the members of the DOC. Any thoughts on how to encourage better care of these (mostly rental homes) would be appreciated. The town is not an HOA, so I personally have zero interest in establishing rules on paint color, garden beds, and mailbox placement.\nThe DOC has also noticed how “ADU” (Accessory Dwelling Units) are being mandated at a region/state level in many places across the US. Montgomery County is working on formal rules for these units right now I believe. PG County currently has no rules and effectively these types of living spaces are not allowed.\n\nAll of these are in the fact finding phase (or earlier) and no substantial funds are being apportioned for any of these. So you can just keep your pitchforks oiled and dry for now. Well, money is being spent on the #1, but only for engineering / contracting / design costs. This would potentially be a million (?) dollar plan so we have to plan it, not just point our fingers and rip up curbs, roads and parking lots. I doubt we can afford to do everything on stormwater that is proposed, so we will have to pick based on impact.\n\n\n\n",
    "preview": {},
    "last_modified": "2023-02-08T10:06:09-05:00",
    "input_file": {}
  },
  {
    "path": "notes/2022-05-17-2022-05-17-town-council/",
    "title": "2022-05-17-Town-Council",
    "description": "Budget Mush",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2022-05-20",
    "categories": [],
    "contents": "\nNew Mayor!\nCongrats to Ward 1 Councilmember Joel Biermann, our newly elected UP Mayor!\nWhy no posts for so long?\nWork busy\nLife busy\nCouncil budget season is just madness with 3+ hour meetings which turn my already squishy mind into mush\nMost important - STOP USING THE BLUE USPS DROP BOXES FOR CHECKS\nThere have been several cases in University Park where checks have been STOLEN OUT OF THE BLUE USPS BOXES. Apparently thieves have the keys and are ransacking the boxes for checks. This sucks. Stop using the boxes ASAP. We have two checks we sent recently which…haven’t arrived been received yet and we are nervous. This is a DC-region issue.\nIf you have sent a check please verify that the recipient has gotten it!\nBudget\nWe passed the budget on Monday May 16th.\nNotes:\n2 new police officers\nWhy? The town has been on 8 officers for many many years. 20? More? The increasing densification around us appears to be driving more incidents in town. The Chief has been running his officers ragged (denying or delaying leave granted) over the past year and has been spending more on overtime. The Chief has been concerned about delayed response times at night. While crime is low, there have been some troubling incidents. This was a tough vote - there was a motion to only hire one new officer instead of two, contrary to what the Chief and the Mayor wanted. This motion failed 4-3 (I voted against, which meant I essentially voted to hire two officers). In the end, I decided to trust the Chief when he said he needed them.\n\nTaxes are the same for you. You pay the same amount (at least to UP) that you paid last year. And the year before. I forget when the last tax increase was. Given the rampant inflation I think it will be difficult to continue to keep taxes level. Expenses have gone up fairly dramatically in some cases (gas). We are raising town employee salaries (by 3.5%, which does not come close to matching inflation calculated at over 6%). We have managed to keep taxes level because of increased revenue from the speed cameras and COVID-related emergency funds. Neither of which are long-term revenue streams.\nFactoid: UP gets about 30% of the total on your property tax bill. The rest goes to PG county / Maryland. If your tax bill is higher than last year’s, it is not because of UP.\nThe council requested and allocated money to install EV chargers at town hall and make the first tentative move to electrify the town’s vehicle fleet.\n$65,000 towards improving security at the town garage and evaluating improvements (roof and improve inside layout)\n$300,000 for two new pedestrian bridges. One to replace the missing bridge and the other to replace its very very old twin. I attepted to halve this amount as I argued we should only replace the missing bridge. This failed. $125,000 of the $300,000 comes from the state of MD as a grant.\n$300,000 for new tot lot equipment. $250,000 of this comes from a state grant.\nParking Enforcement: a few thousand has been allocated towards this. While nothing concrete has been set up yet, the idea is to begin some form of parking control. Not to raise revenue or harass UP residents parking the wrong direction…but as another means for the Chief to help keep track of issues. He has expressed concern that the town is considered a safe place to hang out or conduct “business.” On the west (Adelphi) side of town there has been persistent issues with cars from out of the town parking within UP.\nWard 5 Block Party\nI was hoping to organize one on Oakridge in May, but we we couldn’t make it happen (my wife co-directed Azalea Classic and budget time really increased the work load for me). Given the increasing COVID case counts (wear masks inside!) and the near entry of the summer heat wave, I am now planning on holding it in the late summer / early Fall.\nHere is what I need from you:\nSomeone to host a bounce house (a flat-ish front yard on Oakridge)\nSomeone to help collect funds for the bounce house (it should cost around $200)\nSomeone to set up music (either speakers with a playlist or a band?)\nSomeone to organize the pot luck (roughly coordinate who will bring drinks/snacks/plates/etc.)\nUpcoming issues for the year\nTree ordinance. I will vote for it - I think it is fairly modest in scope. Essentially if you have a big tree, you can’t cut it down without asking first. If you do, then you are fined. This is to help protect the stressed out tree canopy in town. On both sides of our house we lost all the large trees - one because an elderly resident became scared that the large trees would fall on her house. Her landscaping company was very happy to oblige. Another because a local developer decided to virtually clear cut the lot before getting permits to build a giant college housing object. Which….many years later is still not happening. I think the ordinance, if it existed at the time(s), would have helped. After each of the tree clearing incidents we lost large trees in our yard in high wind events - trees grow together and it is very stressful for large trees to suddenly be more exposed.\nParking - I don’t believe many details of this have been worked out. But obviously this could be a fairly substantial change to the streets if a “heavy” option is used. By “heavy” I mean the town would require a permit to park in town and visitors would require a temporary parking tag. I don’t have any idea where this is going right now but will keep you updated.\nShuttles. To briefly summarize, the town had a shuttle program. It was fairly expensive, costing around $100k / year (or about $105 per house a year) given it was used by very few residents (around 80 trips a day if I remember correctly). The full town revenue is around 3.5 million. Obviously programs like the police or the public works department cost far more - but everyone in town benefits from that. Mayor Carey shut down the shuttle when COVID happened - as it was unclear how to run the shuttle safely - and usage plummeted. One major issue with the shuttle system was that the size of them required a CDL license to operate, which made it more difficult to find drivers, especially given the part-time nature of the job. The Mayor also set up a “Transit Task Force” to evaluate the shuttle program. They produced an excellent report, which you can find here.\nI am the chair of the second transit task force. Which includes many town residents donating their time. We meet the second Tuesday of each month. Like all meetings, they are open to the public. We are to make a decision in the Fall. Around November we are to give a presentation and finish our report. I will tell you that, from my perspective, I am currently finding it difficult to justify re-starting the program given: 1. the fairly sparse usage of the program before COVID and 2. the dramatic decrease in commuting post COVID (the local metro stops have about 33% of their pre-COVID ridership right now). But we will produce our survey and distribute it. If we find that a huge amount of the town desires a shuttle program (with the accompanying costs) that would certainly be influential!\nWe have also asked the Town Administrator to work out what the costs of the program would be with a smaller (15?) person shuttle that would not require a CDL license.\nSome other shuttle-related tidbits:\nNo, random people can’t drive the shuttle.\nNo, volunteers cannot drive the shuttle. Unless a small number of people wanted to undergo training and etc etc for some unknown reason. But we aren’t running a shuttle program on the idea that residents will undergo training and donate their time to drive a shuttle around for 4 hours a day indefinitely.\nIf you are approaching this issue from a climate angle, then you could argue that removing car trips is highly beneficial. As I see it, if very few people use the shuttle (and thus it is driving around empty all day long) then it may not be very beneficial. Furthermore there are opportunity costs. $100,000 spent on a shuttle is money that cannot be used on, say, solar panels or EV police cars / public works trucks.\nOne thing that is fairly different from when the shuttle was started up is we now have a large scooter program.\nFrom what we have heard, the paratransit usage of the shuttle was modest and it appears that volunteers (with their personal cars) are handling paratransit requests without much strain.\nThere was widespread agreement that the previous shuttle route was … not optimal and was confusing to understand. A new shuttle program would have a new route.\n\n\n\n",
    "preview": {},
    "last_modified": "2023-02-08T10:06:09-05:00",
    "input_file": {}
  },
  {
    "path": "notes/2022-03-25-2022-03-25-town-council/",
    "title": "2021-03-21-Town-Council",
    "description": "Watch your street",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2022-03-25",
    "categories": [],
    "contents": "\n2021 03 21 Town Council Meeting\nMayors notes:\n$125k highway bill grant is likely to be given to UP\ncourtesy of the state of MD\nthe money is intended to replace/repair the famous town creek bridge(s)\nGiven previous estimates, this is a very helpful amount of but I do not expect it to cover installing both bridges\nSo we will have to see what an engineer says about the install cost\n$225k tot lot upgrade is in the Governer’s budget and is likely to be passed\nThe Mayor gave permission to DeMatha to use Town Tennis Courts between 3:30-5:30 M-Th\nMarch 28th - May 5\nNew Veoride contract nearly done! Mayor and Mr. Beall have been working to identify new sites. “Forced parking” the new system. So all the scooters are supposed to be left within a designated parking zone.\nThe Mayor and Mr. Beall identified 23 potential sites\nIt will be narrowed down to 10 spots\nThe final list will be brought to the council for approval\nPG County Councilmember Glaros is presenting next council meeting (2021-04-04)\nShe will be discussing sediment control and storm water control\nMartha Wells hoping she will discuss traffic issues (EW Highway / Adelphi pedestrian crossing with highly ignored no-turn-on-red)\nAdelphi road sector plan may be discussed as to how it relates to pedestrian access, road design, and traffic control?\nCM Ward 7 Roland Stephens proposed stipend for town council members - $1800/year?\nMayor: needs to be an ordinance. No current council member could receive benefit until being (re)elected\n4/4 meeting bring it up for notice (not adoption)\n\nI think I am against this - I don’t see the point of doing this unless it helps attract more candidates to run for the position.\nBiermann\nNo Mow April/May? - the UP Code Enforcement Officer has been alerted to not hand out citations for overgrown yards (unless they appear to be due to neglect)\n4/23 Town Stream Cleanup\n6/25 Meadow Day, 10am-12pm. Native plants available to residents. Presentations / booths from various groups (Anacostia Watershed, Beekeeper, Tree Committee)\nChief\n5 incidents\nWard 1, 3/1 women parked in car. Resident approached car. She ran, assaulted different resident, and arrested by UP Police. Chief reminds us all to please not get confrontational - the police are trained at handling these situations.\nWard 3, 3/16, Balt. Ave victim of money order fraud\nWard 5, 3/4. Suspicious vehicle reported. 6900 block of Pineway. Turns out be a stolen vehicle.\nWard 7, 3/11 6800 Wells - unoccupied vehicle on crates. Resident said it had wheels the night before.\nWard 7, 3/22 4000 Underwood, resident robbed at gunpoint of backpack by four people at her door.\nMore patrols in Ward 6/7 in response\n\ndoing loud car stops\nTraffic detail coming up\n2/10 NCIC audit passed\n5/6 movie night in the park\nPlease contact police if you see a suspicious vehicle. Police will do a welfare check.\nnon-emergency number: 301-352-1200 <- this is a PG County Number. The chief asks you use this at this is linked into a call tracking system. Asks for calls about illegally parked or strange vehicles.\n\nSpeed camera going live soon - perhaps this week? One month post going up, will go “live”\nPublic Works Director Beall\n5/6 pickle ball demonstration (same as Movie Night)\nThe county continues to slowly move on giving out permits for Phase 2B\nMr. Beall is hoping to get the permit in April\n\nThe town is using Soltesz for estimation of PG County stormwater acceptance project (bring up storm water system elements up to date)\nonce we have estimation of design and construction costs, then we can submit to county for MOU whereby the county would reimburse the town for expenses\nthe under-sized storm water system underneath Claggett-Pineway (and running between a few houses on Pineway) is the primary concern of this work. Also looking into adding inlet at Claggett-Pineway/Woodberry (would depend on engineer’s opinion of the usefulness of it)\n\n\n\n\n",
    "preview": {},
    "last_modified": "2023-02-08T10:06:09-05:00",
    "input_file": {}
  },
  {
    "path": "notes/2022-03-20-2021-03-20-town-council/",
    "title": "2021-03-07-Town-Council",
    "description": "Infrastructure Day",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2022-03-21",
    "categories": [],
    "contents": "\n2022-03-07 Town Council\nMayor Notes:\n3/30 the Hyattsville Library ribbon cutting!\nUPCA is alive and is seeking event chairs and a president\n4/2 is the UPCA Yard Sale\nMayor has asked staff to open Town Hall to the public in the Spring.\nIn person council meetings with Zoom? Probably would happen with the incoming Mayor. Town Attorney Ferguson points out we can’t use the 2nd floor of town hall as not ADA compliant (Zoom doesn’t count).\nBiermann Notes:\nSustainability committee looking into making UP:\nMonarch Waystation\nBee City\nMore pollinator spaces\nAdvertising “No Mow May”\n\nApril 23rd: 10am Town Stream Clean (Town Field)\nJune 25th: Meadow Day 10-12\nTown Park Plan RFP: Make a timeline to finish comments\nMickey Beall:\nHe explained the council should allocate another $300,000 or so to finish the town infrastructure project.\nMoney was allocated for this project 3 years ago. Over the past three years, a few changes have happened that have increased the price tag:\nExpanded scope of sidewalk repair to take advantage (~ 350 homes) of cheaper original pricing\nPermitting is increasingly a challenge. The original hope was that the town would get approval to finish “Phase 2B” in October 2021. The town is still waiting for approval.\nIn the end the $2.6 million dollar project (original budget) is now $2.9 million. So there is a $329,292 overage from the original allocation from 3 years ago. In money term, about $100,000 is from doing extra work (fixing more trip hazard sidewalks) and about $200,000 is from increased costs of construction (inflation, essentially).\nThe town will likely use our reserve to pay for the overage\nThe bridge (near UP Elementary) will also get some cracks repaired. It has 10 years of deferred repairs and the Town thinks this is important we should get it done. While removing this from the construction would save $100,000 in the near term, I don’t like to idea of kicking the can of bridge repair down the road any further.\nThe council passed this request 6-0. Yes, paying more is highly annoying, especially as a lot of the fault seems to lie with the county level permitting process being slow. But given the rampant inflation we are living through, this is (in my opinion), a not-crazy cost overage. These repairs will put the town in a good position over the next decade and beyond, I hope.\nPublic Safety Subcommittee Meeting (2021-03-09)\nJust some quick costs that Mickey gave for various road “features.” Useful numbers to have in mind when thinking about requesting improvements to your own street:\n$14000 for a table top sidewalk\n$3500 speed bump\n$1000 blinking stop sign\n$5000 blinking speed sign\n$8000 blinking crosswalk (example in front of UP Elementary)\n$80 stop bar (the white line at each stop sign)\nWe on the public safety committee will ask the full town council to adopt a town wide 20 mph speed limit.\nDOC (2021-03-10)\n JC Penny at PG Plaza Mall getting turned into an apartment building. The developer will also extend Toledo Road through to Toledo Terrace (when you cross into the mall it isn’t really a road….just a mall parking lot exterior lane thing). I asked the committee to recommend that the full UP Town Council formally ask for protected bike lanes as the developer was proposing just putting some paint on the road for a bike lane. As I believe they are rebuilding Toledo Road, it seems like a missed opportunity. We are also going to ask for details on storm water management (their engineer was not on the call).\n\n\n\n",
    "preview": {},
    "last_modified": "2023-02-08T10:06:09-05:00",
    "input_file": {}
  },
  {
    "path": "notes/2022-02-23-2021-02-22-town-council/",
    "title": "Town Council 2022-02-22",
    "description": "Another catch up post",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2022-02-23",
    "categories": [],
    "contents": "\nApologies\nAgain, it has been a bit too long since my last post (a month!)\nBrief Updates\nMurky water continues to be an issue in Wells Run (due to the development south of Northwestern High School). The town is aware and continues to work with PG county to get the developer to properly install runoff controls.\nLegislative request to the Maryland legislature for bridge replacement. The council authorized a request to get money matched for the pedestrian bridge replacement(s). The town has already spent a bit of money (on the bridges themselves) but has balked at the full replacement as the cost for the install alone was breaching six figures. This would be “free” money to the town, if the request was accepted\nThe town plans on buying our own traffic counters to quantify in-town traffic impacts\nThe speed camera on Baltimore Avenue will go live very soon (mid-March)\nVoting for Wards 1, 3, 7, and Mayor (Mr. Carey is term limited and, to the relief of his wife, will not be running) on May 3rd. Both voting by mail and dropoff. 1pm - 8pm in person voting. Same system as the last election.\nApril 4th cut-off date for new residents to register to vote.\nIf you previously lived in UP but moved, you must update your address.\nShuttle buses are to be sold. See further down for more details.\nArt in the Park (thanks to the Freemans and Groppes) was a big success last year - the council was happy to the last Saturday in September “Art in the Park” day.\nEngineering firm hired to address storm water issues (see below for more information)\nTraffic Factoids\nChief Baker reported that the 4300 East-West Hwy camera had 3,864,432 vehicle passes and the 7000 Adelphi Rd camera had 2,276,226 vehicle passes from September 12th 2021 to February 4th 2022. That napkin maths out to 15 to 25 thousand cars per day. In one direction.\nThe town continues to rake in money ($70,000 in January alone) from the automated speed cameras - I think we will comfortably “max” out our revenue intake from this program (we can keep no more than 10% of the total town budget). Again, the goal is not to fund another revenue stream, but to reduce vehicular speed around us.\nTransit Task Force II\nThe council has authorized sale of the “old” town shuttles. This is not the “end” of the town shuttle, but rather a chance for a pivot. The mayor has asked me to chair a “Transit Task Force II” committee - which will be composed mostly of town residents who have very kindly offered up their time. The goal of the committee will be to produce a white paper that covers a few topics:\nAssess future demand for local bus and para-transit services. Are there other or better options for each, such as micro-mobility, which will affect the future demands for them?\nShould the program be restarted, what should the route(s) be? We will have a purple line (so help us) and have other potential destinations to consider (College Park Academy, Whole Foods, UMD, Discovery District). How to equitably place the stops in town?\nPrioritize low to zero emission vehicle options\nEstimate start up and running costs\nWork with Town Administrator to identify potential start up grant sources\nPresent preliminary report in mid September and final report by early November 2022.\nThe generous members:\nEmily Alvarez\nMarya Link\nJoe Schultz\nMargaret (Maggie) Wessling\nCarol Weese\nDavid Tully\nStaff Liaison - David Deutsch (Town Administrator)\nHelping Hands Liaison - Linda Verrill\nStormwater\nThe council authorized the town to contract out to the engineering firm Rummel, Klepper and Kahl (“RKK”) to study storm water control options.\nThe council was a bit apprehensive at the lack of details delivered regarding deliverables or scope. We have been waiting for months about hiring a firm and at least I was expecting to get a bit more detail than “here is a contract full of boilerplate.” Most of the council inquiries were along the lines of “wait, what are we hiring them to do exactly??” and “how much will this cost??”\nThe mayor agreed to add a $50,000 spending cap to the contract. The mayor and TA Deutsch both made clear they understood our concerns and would be carefully monitoring the work of RKK.\nMy hope is that we will get a rough idea of what projects can produce a useful amount of storm water control at a cost rougly within the bounds of the ARPA (free federal funds) that the town has been allotted.\nThe town has a list of potential projects (many rain gardens) as well as the storm drain upgrade / install along Clagett-Pineway.\n\n\n\n",
    "preview": {},
    "last_modified": "2023-02-08T10:06:09-05:00",
    "input_file": {}
  },
  {
    "path": "notes/2022-01-17-2021-01-03-town-council/",
    "title": "Town Council / Notes 2021 01 17",
    "description": "Got behind, sorry",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2022-01-17",
    "categories": [],
    "contents": "\nBelated post\nYes, I got a behind schedule and have missed a few posts. So this is a catch-up post.\nCouncil\nAdelphi Road Sector Plan\nSoon MNPCC will meet to potentially pass the Adelphi Road Sector Plan. Guilford Woods is within this (very small) sector plan and the plan, as currently constructured, would place high density (in the 4 story or so range) housing in the woods. The town of University Park authorized a letter asking MNPCC to alter the plan to preserve the woods, improve the intersection at Adelphi/Campus Drive/University, ensure that any development at the Guilford Woods / Guilford Run headwaters not worsen flooding issues, improve public facilities, and pedestrian connections. The town will also ask for a pause* in the plan time table to properly implement our requests. I believe the towns of College Park and Hyattsville have similar concerns and will be sending similar letters.\nThe Mayor did say he thought it was unlikely a pause would be granted\nPlowing\nAfter the snow storm on January 2-3rd, Mickey Beall (Public Works Director) reported the town was 100% plowed by 5:30 on January 3rd. I can’t track it down right now but I recall getting an email from a PG county touting 80% of the county roads were cleared by January 5th.\nPublic Safety Subcommittee\nThe town staff requested a town-side set of parking changes to alleviate two issues:\nWalk offs (people parking, then walking away)\nTight turns / sections that impede town vehicles (mostly the garbage trucks)\nTwo requests were made for Ward 5:\nRemove all parking on North Pineway from Baltimore to Oakridge. I strongly recommended against this change as there is “college housing” with a large number of parked cars at the 6934 Pineway which 1. help slow traffic into the neigborhood and 2. would just push them to park further into Ward 5.\nRemove parking across from the Mews alley at Oakridge to help the garbage trucks make the truck out. I am communicating with the owners who are affected to ensure they are OK with the proposed change.\nPhase 2B\nThe sidewalks are to be added at Clagett-Pineway soon. If you received a strange letter from the SOLTESZ group about “A concept and stormwater management plan”…it is in relation to the sidewalks. Nothing nefarious. Thanks to the the resident who informed me about the … strange letter. So if you got one (because you are within a block of the sidewalk) do not be alarmed. I’ll talk with Mickey about getting more useful correspondence in the future.\n\n\n\n",
    "preview": {},
    "last_modified": "2023-02-08T10:06:09-05:00",
    "input_file": {}
  },
  {
    "path": "notes/2021-11-15-2021-11-15-town-council/",
    "title": "Town Council 2021-11-15",
    "description": "New town clerk appointed",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2021-11-15",
    "categories": [],
    "contents": "\nWashington Gas\nApproved MOU. They will soon tear up a stretch of Van Buren to do some gas work\nDOC\nDiscussing “Garden Apartments” in PG Plaza Mall area\nDiscuss new sector plan for Purple Line / our region\nRecycling\nInterest in polystyrene recycling at the town level to be discussed\nSustainability Committee exploring the issue (see more below from Mickey)\nTree and Rules Committee\nWorking on on Leaf blower ordinance implementation language. Tree ordinance being worked on.\nFiscal Meeting\nAuditor says town finances are in good shape\nLEGISLATIVE RESOLUTION 21-O-07\n24 hour monitoring of Baltimore and EW Highway (these are MD state controlled) will be possible now.\nAdelphi is not possible, as that is under PG County control. Chief Baker is working on getting permission for 24 hour monitoring of Adelphi.\nGoal is, again, to slow down traffic on these roads to reduce noise pollution and enhance safety.\nNew Town Clerk\nOur existing Town Clerk, Andrea Markavitch, has moved to Connecticut. The town has hired a new Clerk, TC Hegeman (so she could be addressed as TC TC Hegeman). She is the current clerk of Cheverly, MD. She was interviewed by the Mayor, Town Administrator Deutsch, and Andrea. 30 interviews were submitted. Four were interviewed. TC Hegeman was the unanimous choice of all three.\nTC Hegeman will begin her job next week. Andrea will be gently transitioning out of her position, so she can assist the incoming Town Clerk.\nChief Baker\nNovember 2nd: UPES. Rock tossed through window. No video footage.\nTwo similar incidents of busted windows at the bus shelters in the region\nOne officer is a notary.\nTreasurer Baden\n$24,500 in red light camera revenue for October. Will increase. Then decrease as speeds decrease and people get used to the camera. Money can only be spent on public safety.\nPublic Works Director Beall\nWard 6 getting sidewalk repairs. Xmas lights to be installed this week. Blankets on town field. Fountain off at town playground. Ward 2 next for leaf pickup. Planting trees in town.\nEPS (Polystyrene). Talked with vendor in Crofton. Multiple Public Works director on the call. Logistical issues. Most crucial is that not much more capacity to collect (at a town amount of quantity). Mickey suggested perhaps adding the EPS collection during the periodic town collection dates (with the paper shredding / electronics recycling).\nPhase 2B. Waiting for permit approval from county. Expecting it in early December, which would be good as the town’s “rate” for the work will get more expensive starting Jan 1, 2022.\nNOT COUNCIL: Beall Run In\nWas chatting with Mickey and asked him about something that had confused me. The council has approved several drain connections underneath sidewalks. I was confused who was requesting these and who was paying for them. Apparently when the town replaces sidewalks, they ask whether the homeowner wants an existing drainage (sump / etc) pipe that exits onto/near the sidewalk routed underneath the sidewalk and exiting onto the road. The town is paying for these. Which costs (ballpark) around $300. This is two fold:\nEveryone hates having drainage onto the sidewalks, which freezes in the winter and thus makes the sidewalks hazardous\nIt was very hard to get a homeowner to agree, on very short notice, whether to pay for the piping.\nSo, if you see white lines being drawn on your sidewalk and know of some pipes that could benefit from being routed onto the road, please contact Mickey immediately. I noticed Ward 5/Pineway was marked up today.\n\n\n\n",
    "preview": {},
    "last_modified": "2023-02-08T10:06:09-05:00",
    "input_file": {}
  },
  {
    "path": "notes/2021-11-11-2021-11-01-town-council/",
    "title": "Town Council 2021-11-01",
    "description": "Yay more road destruction",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2021-11-11",
    "categories": [],
    "contents": "\nWSSC and Washington (?) Gas town wide project\nRepairing / replacing piping. Which will tear up roads, of course.\nWe are asking for MOU for money to repair the road “scars” ourself\nThey (WSSC / Gas) will temp patch (ugly)\nThen town later will use $ to repave (pretty)\nIn the past they give more $ than we need to do repaving ourself\nSo thus we get some “free” repair work\nTown Council approved variance for 6 foot fence\nApparently the “back edge” of the house is where the 6 foot fence has to end\nbut they had a small (1/3 width of house) addition and wanted the fence to match the “old” back edge of house\n11/16 is the public hearing for the PG County district map redistricting\nWe are all very mad\nWe will update and re-send the letter to say we still hate the sham “compromise” plan\nAdelphi road purple line plan\nCounty planning for high density at Adelphi / University Blvd\n+2000 new units?\nTown must keep track of the development\nTown will likely be disbursing donations to food banks in the area in early December\nseveral area food bank needs\nLen is coordinating with other local mayors and Danielle Glaros\nMuch overall need, town trying to be fair and distribute in an equitable and useful manner\n~125k for December\nRFP for Town Hall work\nWe have $240k in our “piggy bank” for the town hall\n(well we put in 40k and the state of MD put in 200k)\n\nGoals:\nTemporary (?) office space for ~30 person meeting space\nIndoor workspace for public works (same as the meeting space?)\nBuilding security (cameras)\nStorage shed (separate structure - nothing intricate)\nUpgrade electrical systems for charging of electric vehicles in the future\n\nTo be clear: WE ARE NOT DOING ANYTHING - THIS IS AN RFP, A REQUEST.\nFurthermore: THE COUNCIL WILL REVIEW THE RFP BEFORE IT GOES OUT\nGeneral agreement that the last proposal (the $4,000,000 Arnold one) was not well specified\n\n2021-11-02 Len Chat\nMayor concerned about Trader Joes effect on parking in Ward 5 - perhaps alter parking rules / signage in Ward 5 and 6 (Whole Foods also potentially causing some parking issues?)\nPotentially hire part time parking enforcement\nWe worry now so we are prepared should there be an issue in the future\n\n\n\n",
    "preview": {},
    "last_modified": "2023-02-08T10:06:09-05:00",
    "input_file": {}
  },
  {
    "path": "notes/2021-10-19-2021-10-18-town-council/",
    "title": "Town Council 2021-10-18",
    "description": "ARPA, but not that ARPA",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2021-10-19",
    "categories": [],
    "contents": "\nThe Advanced Research Projects Agency, or ARPA, supported the development of the ARPANET, the first packet switching network in the US. The precursor to the internet.\nSo everytime we discuss the ARPA, my ears perk up. Except that this is the American Rescue Plan Act . Which is also important. But in a very different way.\nAnyways, this meeting had one of the first overarching discussions about apportioning the ~2.3 million the town will receive from ARPA over the next two years.\nWells Run\nCM Martha Wells had noticed that Wells Run had gotten murky. CM Wells and the Mayor, after much leg-work, got the developers of some upstream work at Adelphi / Belcrest to fix their silt fence and lay sod / mesh to help control runoff.\nARPA proposals (just proposals!)\nClimate Change and Resilience\n50% ?\n“We have a growing list of potential locations, including recent discussions relating to certain alleys in Town. We will retain an engineer to develop specific details for the various projects…..developing plug-in capability as the Town fleet and equipment migrate(sp?) to an electric future.”\n\nNon-profit support\n10% ?\n“In 2020 Council allocated $25,000 of the Town’s $171,000 CARES Act money to support area food banks…Council could direct a 10% allocation of ARPA for non-profit support. This approximate $250,000 would be a great boost for programs serving people with ongoing needs in the region”\n\nIncrease pay for town employees\n“An allocation of approximately $200,000 would cover a $2.50 per hour temporary increase in pay for two years for our front- line employees, including public works and police (twenty employees maximum). A $104,000 annual cost per year would provide a $5,200 increase per year for eligible employees. This allocation addresses the ongoing need to remain competitive in police salaries, and it also fulfills the ARPA mandate to include workers who represent lower wage categories within the Town organization. With Council’s concurrence this program could begin with the first payroll in January, 2022.”\n\n“The recommendations above account for approximately $1,750,000 of the Town’s ARPA allocation. This total still yields a balance of $450,000 for future allocation.”\nIf you have suggestions - then now is the time to bother me. Very roughly, the money can only be spent on climate resilience, broadband, and COVID-related stuff.\n(Re)districting\nIn ugly politics news, the PG County Council passed a surprise redistricting plan that dramatically altered our area. College Park would be tossed into District 1 (with Laurel?!). Among other bits of local areas getting flung about. The four against (including our local council members) were horrified that a dramatic alteration of our political map would happen with literally zero notice or public input. In what-must-be-a-total-coincidence this redistricting would disrupt several in-progress campaigns and help certain council members.\nWhile there may (????) be valid reasons for re-configuring the map, the county council has not deemed us worthy of those reasons.\nThe council authorized the Mayor to send a letter voicing our disapproval to the county leadership.\nUnfortunately the letter had little effect as just tonight (10/19) the council again forwarded the map, with few changes.\nGuilford Woods\nThe DOC disapproves of the proposed land transfer from UMD to Gilbance. Council asked that the Mayor and CM Wells follow up with Senator Pinsky about how to most effectively communicate our message, as the transfer takes place at the state level. This is not something the town is familiar with.\nParking Sticker\nUPMD.org page has now a link to request a “UP” parking sticker for you car. Not required, but the police like them as it helps them quickly see who is a resident.\nParking Permit & UP Sticker Request Form\nPolice Chief Baker\nnot many seem to know that the town reimburses (up to $100) for security systems (Home Security System Rebate Form)\nsgrady@upmd.org is a notary and has been trained in car seat installation\nOverall, many of the town employees are notaries….too many for me to keep track of. Perhaps email our Town Clerk Andrea if you need notary services?\nMickey Beall\nstill working on permitting for “Phase2b” sidewalk install on Clagett Pineway / etc.\nElectric charging on Queen’s Chapel Road: Updated electric panel. 3 online as of today (1 fixed recently). Remaining 3 should be up soon (when some parts come in). Level 2 chargers.\ncompost program is 10 years old! Nearly 40% of town now uses it.\n\n\n\n",
    "preview": {},
    "last_modified": "2023-02-08T10:06:09-05:00",
    "input_file": {}
  },
  {
    "path": "notes/2021-10-11-2021-10-04-town-council/",
    "title": "Town Council 2021-10-04",
    "description": "Pro Tempore",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2021-10-11",
    "categories": [],
    "contents": "\n2021-10-04 Council Meeting\nMayor Len Carey wasn’t present for this meeting (excused), so council member Joel Biermann was the “Mayor Pro Tempore.”\nPamela Boozer-Strother\nOur area’s PTA board member briefly talked about the school issues:\nCommends UP parents for helping improve COVID safety practices at UPES\nSchool year going fairly well so far. Limited number of kids in virtual.\nLittle COVID spread in PG school system\nVery short of bus drivers (started 100 short, now 200 short!!!)\nHoping for a July 2023 finish for Hyattsville Middle re-construction\nPTA concerned about external module / trailers at UPES - trying to improve the appearance\nBoundary initiative - will begin 2023/2024 school year\nMeadow Work\nOn October 16, from 10-12, there will be volunteer work to feed and re-weed the UP town meadow\nTake Backs\nI believe these run from 10am - 4pm.\n10/23 paint/electronic recycling, paper shredding (UPES)\n10/23 drug take-back (town hall)\nAmerican Rescue Plan\nAt the October 18th Town Council meeting, Town Administrator David Deutsch will present early plans on spending the ~2.1 million dollars UP has and will receive from the federal government.\nLeaf Blower Ban\nThe council passed (7-0) the leaf blower ban, with one new amendment. Briefly, as of January 1st, 2024 gas powered leaf blowers cannot be operated in University Park. The companion amendment adds a carrot to the ban (which is the stick). The town will reimburse up to $100 (per household) for an electric-powered yard tool for a three year time period. This program will go in effect in June (?). Details have yet to be worked out for what the fine will be for violoations of the new ordinance.\n2021-10-13 Public Safety Meeting - UP Police Chief Baker in attendance\nSpeed cameras.\n1901 citations written (1656 September alone) so far.\n284 paid.\nMajority are 12-15 mph over the limit.\nAs of 11/1 the council will be asked to amend the town ordinances to allow for 24 hour operation of the speed cameras (only allowed on state roads, so just East-West Highway and Baltimore).\nChief Baker spoke the to Riverdale Park Police Chief about their 20mph residential speed limit. Introduced last year or so. Their chief seems to think it is helpful. Didn’t use a traffic study to justify - had on hand some speed sign and collision data. Essentially their council wanted it. Chief Baker pointed out UP has very few collisions and he is unsure whether a 20mph would have a measureable effect in UP.\n“Smart” Cameras\nChief Baker was interested in a 7 “smart” camera system. Mounted on utility poles. Unobtrusive. Would run at night. Would help the overnight officer automatically identify and alert potential issues. Costs around $60,000. No monthly fees. Chief Baker pointed out that surrounding towns were either running or considering running these systems - in the context of pointing out that thieves are very astute and gravitate to the “easier” areas to “work” in.\nHalloween\nYes, it is happening. October 31. Police will work 5pm - 10pm. The police are aware that out-of-UP people are driving in … and are staying in their car following their kids. The police will encourage everyone to walk for Halloween.\nSignage\nChief would like to add some “no parking, no stopping, no loitering” style signs in some areas as he has had some interactions with out-of-UP people who are … just hanging out in their idling cars.\nNext (public safety committee) meeting\nWill discuss traffic calming measure to consider. Send your input.\n\n\n\n",
    "preview": {},
    "last_modified": "2023-02-08T10:06:09-05:00",
    "input_file": {}
  },
  {
    "path": "notes/2021-09-22-2021-09-20-town-council/",
    "title": "Town Council 2021-09-22 ",
    "description": "Relatively Quiet",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2021-09-22",
    "categories": [],
    "contents": "\nFirst a few notes from the Public Facilities Committee meeting on September 16th (not the town council meeting).\nDavid Deutsch attended\nWe had three asks, in order of importance:\nPrice out a pre-fabricated shed (approximately 25 x 30 feet)\nconsult with Public Works Director Mickey Beall\npurpose is for dry storage of commonly used items, to free up space in the existing town hall and town garage and to reduce employee travel time spent going back and forth\nselect location that would not interfere with potential town hall expansion\nrun power to the shed for lights, security cameras, power outlets\n\nLook into feasibility of temporary housing / unit (roughly similar to temporary classrooms modular units)\npurpose would be threefold:\nsmall meeting space for council / residents\n\ncommon area space for public works / police. In hot and cold weather the fairly sizeable number of staff are sharing a very cozy kitchen.\n\nIdea would be to “demo” the usefulness of an addition on town hall for a much more modest sum of money\n\n\n\nCar charger(s) at town hall\nprepping for future purchases, which are more and more likely to be electric\n\n\nTown Council Meeting\nAward for esteemed Ward 5 resident John Tabori\nFormer Mayor and Ward 5 CM John Tabori was given a (surprise) commendation by PG County Councilmember Dannielle Glaros for his long service to the region in serving on county-level development committees.\nJohn also gave a brief presentation on the formation of the UP Development Overview Committee, which is still very relevant today as this committee is responsible for recommendation a course of action regarding the Western Gateway / Guilford Woods project.\nIf you see John, congratulate him! Without him, we’d likely have no DOC and thus a much smaller voice in the discussion around the development surrounding us.\nArt in the Park\nInaugural “Art in the Park” will happen this Saturday (9/25) from 1-4 PM in the town playing field. 17 (?) artists will be presenting.\nSpeed camera\nWent “live” on 9/13. Generated over 100 tickets in the first two days. Starting 10/1 we will have the option of running the camera 24/7.\nPhase 2B\nStill no start date for the Phase 2B street renovation (which includes new sidewalks on Clagett-Pineway) as Mickey is still working on the permitting.\n\n\n\n",
    "preview": {},
    "last_modified": "2023-02-08T10:06:09-05:00",
    "input_file": {}
  },
  {
    "path": "posts/2021-09-08-2021-09-07-council/",
    "title": "Town Council 2021-09-07 ",
    "description": "Back again",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2021-09-08",
    "categories": [],
    "contents": "\nAugust Recap\nI missed the one council meeting in August (hence no note), as my family was on vacation.\nSkimming the notes I see the council asked the DOC (Development) to formally discuss the Western Gateway project. I updated the post to include some new links about the project.\nThe DOC, this THURSDAY, will discuss the Western Gateway project. While I am on not this committee, I plan on attending.\nThe garage purchase was authorized.\nMickey Beall (Public Works Director) announced that prior to the town trimming / removing trees they would be distributing flyers to nearby homes. This is to allow homeowners to respond should there be confusion over the status of a tree (health and who is responsible for it).\nOK, now onto the September 7th 2021 Meeting\nLeaf blower ordinance\nWe all moved implementation date to Janurary 1st, 2021 (this language was approved). The ordinance was not voted on, but rather delayed to the first meeting in October. This is to allow time for a new, related, ordinance to give $100 (per hoursehold) rebates for replacing gas powered lawn equipment with electric equivalents. The funds for this would not come from the town budget, but rather the American Rescue Plan funds. From conversations with the other council members, it seems pretty consistent that everyone is getting about 50/50 yea/nay comments. So, no matter the outcome, people will be angry. I plan on voting for the ordinance as I feel the externalities (noise / pollution) are being unfairly shouldered by everyone in town. But the Mayor, while supportive of the sentiment to ban the gas blowers, leans against a straight ban. We will have to see what comes out in the end.\nUPES Pavilion Damaged\nI noticed that one of the vertical supports in the UPES Pavilion was 90+ % rusted out. The mayor let me know that Mickey had noticed this months ago and had informed UPES, but it still had not been fixed. In the town council meeting the Mayor informed us that our school board representative (Pamela Boozer-Strother) was looped in to help push PGCPS to fix the pavilion. The COO of PGCPS agreed to send (another) crew to see what repairs could be done. All parties (UP, UPES, Pamela) wish to repair, not remove, the pavilion.\nTown Charter Refresh\nThe town charter is being updated by the town clerk and attorney. Largely the changes are to remove and update outdated language. One notable potential change relates to permitting - right now the town charges $10 for a town (contracted) engineer to review storm water / drainage related issues with new builds. Apparently this is costing the town (e.g. all of us) about $400-$500 each time - the council was surprised and the sentiment seemed to be that the home owner should be paying for most, if not all, the cost.\nTrees\nTrees. Chris Aubry reported on the tree committees work. 30+ trees were planted using the town’s funds to defray the cost. Chris would like the town to buy LIDAR data to quantify the town’s tree cover. Unclear on what the cost would be. Council and Mayor were supportive, assuming the cost was reasonable.\nTown Administrator\nThis got surprisingly testy for a few minutes as the Council blocked the Mayor’s request to amend the TA contract. This was largely due to a misunderstanding. We were sent a brief packet on the the contract and it appeared that we were approving new benefits, like $1000/month allocations for travel-to-UP expenses. Apparently this is already in the TA’s contract (which was approved by the council before I got there) and the only change we were asked to approve was to give time off for hours worked (apparently there was no language at all on this matter) to match the town’s handbook for employees. Once this was made clear, this was approved 7-0. Reading between the lines I’d say there is a trust mis-match between the Mayor and the Council on the TA right now.\n\n\n\n",
    "preview": {},
    "last_modified": "2023-02-08T10:06:09-05:00",
    "input_file": {}
  },
  {
    "path": "notes/2021-08-24-our-garage/",
    "title": "Our Garage",
    "description": "We bought one.",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2021-08-24",
    "categories": [],
    "contents": "\nOur New Garage\n\n4201 48th Street, Bladensburg, MD\nOne large bay. Enough space for a garbage truck and a pickup truck / car to be worked on simultaneously. Though if the main bay is in use (as it is below), then that red pickup is stuck until the garbage trucks is moved.\n\n~4000 square feet (sq ft) of interior space.\n~1500 sq ft of exterior space\nThe town was paying about $37,000 / year. When the long term lease ended (late 2020/early 2021?) the rate went up to about $44,000 / year. The town also paid the utilities.\nRough timeline.\nRougher because the process began before I was a councilmember.\nLate 2020/Early 2021, the town is informed that the 4201 48th Street garage that UP has been renting for the past ten years will not be available for another lease as the owner plans on selling the property.\nIn March 2021 the council is presented other options. The town of Hyattsville offers up their old garage. At about double our current rate for our existing garage and only offers a short-term lease. Two sites in College Park are modestly larger than the current site, but about 2.5X our current cost. One is substantially smaller and about the same price as we currently pay. The owner of our existing garage informs the town the will sell in about September on the open market, as for $995,000.\nThe town begins an exclusive (one on one) negotiation with the owner of the 4201 48th Street garage\nIn a closed session (June?) we (Mayor and council) are told that the town continues to look for alternative sites (for sale or rent) and has been negotiating back and forth. No good alternatives (within the price/size/distance constrains) have been found. The council urges the administration to work on back up plans should the negotiations fail.\nA few weeks later we are informed a deal has been reached at $825,000.\nThe town is notified in the Town Council meeting and with a flyer about the impending purchase.\nWe learn that we can use American Rescue Plan funds to pay for approximately $375,000 of the cost, meaning no mortage needed to be taken out. The town had already (last fiscal year) allocated $450,000 for the potential purchase.\nSo why are we buying it?\nUP has “in-sourced” the public works operations\nWe own our garage trucks. The garbage trucks are operated and maintained by town staff, including our own mechanic.\nThis requires a garage to maintain / fix our town equipment and the site also serves to store supplies and equipment (the garbage trucks, replacement trash cans, the leaf suckers, extra street signs, etc).\nThis is our best option, buy or rent.\nStoring extra stuffsWhy don’t we just out source the maintenance?\nWell, then we would be reliant on someone else to fix our stuff. In practice our Public Works Director (Michael “Mickey” Beall) has said this means that it can take days / weeks to get repairs done. Which means that the town would have to buy more garbage trucks / etc to cover the extra down time and thus require even more space to store the equipment. Our mechanic works full time to maintain all the town (including the police department) vehicles and equipment.\nIs this is a bad deal?\nIt doesn’t seem like a fabulous deal. I don’t understand the commercial market. We were told that the recent jump in home prices has been matched by the commercial market. Mickey told me he thought this garage was a useful size for many businesses and he wouldn’t expect it be difficult to sell the garage, should the town ever go in a different direction. In the end, this was the best choice available. The good news is that that we used a restricted pot of money to partially pay for it. We also control the site now, so there is reduced risk of “surprise” expenses (remember if we were to rent a different garage our best options looked like they would double our cost). The site has been inspected. The building (except maybe roof) is in good condition. Long term, I think this is a good move. The town is full-in on running the public works in-house and a garage is a core component of that approach.\nSide lot for vehicle parking and storage of goods\n\n\n",
    "preview": "notes/2021-08-24-our-garage/IMG_4060.jpeg",
    "last_modified": "2023-02-08T10:06:09-05:00",
    "input_file": {}
  },
  {
    "path": "notes/2021-07-20-council20210719/",
    "title": "Town Council 2021-07-19",
    "description": "The (virtual) room where it happened",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2021-07-20",
    "categories": [
      "notes"
    ],
    "contents": "\nDanielle Glaros presented on storm water projects:\nPG county has challenging topography for flooding because:\nPoor drainage\nLow lying\nWaterways everywhere\nBecause of this, PG county has stronger storm water management than the state of MD requires. Essentially every new development needs to control 100% of the run off. The MD standard is 50%. However, older developments have zero storm water management.\nOne interesting nugget was that because of these strong regulations new developments reduce the amount of run-off downstream.\nUP has two waterways:\nWells Run\nGuilford Run\n\nShe focused mostly on Wells Run. The 9 Ponds project will likely start within 6 months. Will take about a year to complete. Will be a pond with a path around it. Goal is to make a desireable amenity. Unfortunately trees will be removed to make the pond (designed to retain as many as possible and to replant new ones). The creek upstream of the pond will also be cleaned up to improved flow. Half of water than runs through UP / Wells comes from the PG Mall.Hopefully this will have a large impact for UP.\n\nGuilford Run has some storm water drain work to be done downstream of UP (east of Baltimore).\nMs. Glaros emphasized that water management needed to be managed where it was created. There are no magic bullets. We have to work to control the water we have with rain gardens, reducing impervious surfaces, etc.\nShe is introducing legislation to increase the amount of money the county will reimburse for on-property water control (rain barrels, rain gardens, pervious pavers, etc.).\nAmerican Rescue Plan\nThe town of UP will receive approximately $2.1 million from the US Government over the next two years. The first million will be received very soon. While this is free money it has restrictions on how it can be spent. Very briefly, it can be spent on climate change mitigation (storm water), broadband investments (internet), and COVID-19 mitigation (food banks / small business loans). The town (and committees) are still formulating how the money will be spent. Most of the money will likely go to storm water mitigation. The mayor of UP is looking into hiring a consultant to make a comprehensive Wells Run Watershed (which includes Hyattsville, UP, and Riverdale Park) storm water management plan. The money must be allocated for a project by 12/31/2024 and spent by 12/31/2026.\nWe bought a garage\nThe town of UP is buying the garage that we have leased for the past 11 years. Why? Three reasons:\nThe owner is selling it\nWe are unable to find an equivalent garage within a 20 minute (or even longer….) drive. Much effort was spent trying to “share” garage space with neighboring towns with little effect. The town is a touch salty because we thought we had a deal with Hyattsville….then the terms were changed.\nWe need a garage to fix and store our town equipment (there is a reason you don’t see garbage trucks parked at town hall….)\nThe town administrator (David Deutsch) and the town lawyer (Suellen Ferguson) have been negotiating for months. We have a deal at $825,000. $450,000 was allocated in the last budget for this expense. The remainder will be paid using American Rescue Plan funds, as apparently this is an allowed use of the money.\nThis is good news because:\nWe control a very important piece of infrastructure (a medium-sized garage) that is getting increasingly difficult to procure with the continuous development in the area. We literally were unable to find another equivalent garage (size / location / cost) for lease or sale.\nWe paid “cash” for it and this now frees up about $42,000 / year for the town that was going to the lease.\nWe can always sell it should our needs change\nOur inspections reveal no pollution or structural issues, aside from a leaking roof\nTown Head Notes\nAndrea (town clerk) would really like more town residents to sign up for relevant alerts (e.g. “News and Announcement”). I wrote why you should sign up here.\nDan (Treasurer) briefly summarized the 2020 spending (fiscal year ended 6/31).\nMickey (Public Works) said that the two storm water mini projects (permeable paving at 44th (?) and a rain garden at Claggett/College Heights) were looking great because either one would be enough to meet our PG County requirements. We could save money by doing one or do both and bank extra storm water credits.\nChief Baker had no crime to report. Thanks were given for the UP Town Police’s (and Park Police with their horses) role in the July 4th parade.\n\n\n\n",
    "preview": "notes/2021-07-20-council20210719/glaros_screenshot1.png",
    "last_modified": "2023-02-08T10:06:09-05:00",
    "input_file": {}
  },
  {
    "path": "notes/2021-07-07-council20210706/",
    "title": "Town Council 2021-07-06",
    "description": "The (virtual) room where it happened",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2021-07-07",
    "categories": [],
    "contents": "\nIncomplete, possibly inaccurate notes on what happened. Not official.\nGas blower ban: Continuation (delay) for 2 months for the Policy, Rules & Municipal Structure Committee to make some changes. At the September 7th Town Council meeting the ordinance will (likely) come up for a vote. If you care about improving the ordinance, I suggest you attend the August 5th Policy, Rules & Municipal Structure Committee meeting.\nI will be serving on the Public Facilities and Services Committee (e.g. town hall renovation) and the Police, Traffic and Public Safety Committee.\nLoretta Vitale Saks was formally honored for her role in establishing and running the Helping Hands University Park special committee. Linda Verrill will take over as chair of the committee, as Ms. Saks will be leaving UP soon.\n\nThe “Infrastructure 2B” walk through was briefly discussed by myself. New sidewalks being added on College Heights Dr, Clagett, Claggett-Pineway (and other roads off of College Heights Dr). Notably the roads will be narrowed to 26 ft. While not ideal, sidewalks will generally be right next to the road to reduce the number of utility poles that need to be moved and to protect mature trees. While not discussed the “far” side of Clagett-Pineway (closer to College Heights Dr) will likely be narrowed to 24 ft and parking removed from one side to reduce the amount of yard that will be taken, as this portion of Claggett-Pineway is already 26 ft.\nThe town will be hosting the first “Meadow Day” on July 24th!\n\n\n\n",
    "preview": "notes/2021-07-07-council20210706/saks.png",
    "last_modified": "2023-02-08T10:06:09-05:00",
    "input_file": {}
  },
  {
    "path": "issues/2021-06-19-blowers/",
    "title": "Blowers",
    "description": "Full of air",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2021-06-19",
    "categories": [
      "issues"
    ],
    "contents": "\nIssue\nThe UP Town Council will soon (July 2021 or so) vote on whether to ban gas-powered leaf blowers as of January 1, 2023.\nMy position\nLean no (as of June 19 2021)\nSome background reading\nUP Policy, Rules, and Municipal Structure Committee statement: here\nAtlantic article on how and why DC banned gas-powered leaf blowers as of 2022: here\nDCist update on DC residents trying to push up the ban date: here\nWashington University post that briefly summarizes the air pollution impact (on all gas-powered yard equipment, not just blowers): here. “A 2011 study showed that a leaf blower emits nearly 300 times the amount of air pollutants as a pickup truck. Similarly, a 2001 study showed that one hour using a gas-powered lawn mower is equivalent to driving a car 100 miles.”\nThe resolution\nRead it here.\nThe relevant line is “BEGINNING JANUARY 1, 2023, IT SHALL BE UNLAWFUL FOR ANY OWNER OR OCCUPANT OF REAL PROPERTY LOCATED WITHIN THE TOWN, OR ANY GUEST, EMPLOYEE OR CONTRACTOR OF SUCH PERSON, TO USE A GAS- POWERED LEAF BLOWER ON THAT PROPERTY.”\nPros for banning gas powered leaf blowers:\nGas-powered leaf blowers emit SUBSTANTIAL air pollution. Electric does not. Pollution is produced by electricity creation of course, but it is from an emissions-controlled power plant very far away. Essentially gas-powered blowers make the air worse for you and your neighbors, some of which suffer from respiratory issues.\nGas-powered leaf blowers emit SUBSTANTIAL noise pollution. You all know. You can hear it. From my brief Googling: gas blowers (at 50 feet) emit around 80-90db (which is in the “damages your ears” range) and comparable electric blowers emit around 60-70db (which is in the “maybe annoying” range).\nCons for banning:\nIn the short term, it will likely drive up cost of contractor yard maintenance.\nIn the short term, contractors may refuse to work in UP\nMy longer position\nPersonally, I think this should pass as written. But….I’m young (or middle-aged depending on your perspective), hand-rake my yard, and don’t usually pay contractors to do yard work. I understand many people do rely on contractors to keep their yard maintained. Our town has a lot of trees and a lot of leaves. It needs to be feasible for contractors to swap over to electric for the blowers by 2023. This I am unsure about.\nIf I could see some evidence / persuasive anecdotes that banning gas powered blowers would moderately (or less) drive up costs of leaf removal, then I would lean toward voting “yes.” I am just concerned that switching to electric blowers is not practical in the next 18 months. My brief Googling does not find many “contractor” grade blowers.\nWhat should I do as a neighbor and a member of a community right now?\nAsk your contractor right now to reduce (or even stop) the amount of blowing done in your yard. It seems like the “default” position of yard contractors is to spend 10+ minutes walking around blowing grass clippings around year-round. This is not necessary (unless the aesthetics are very important to you). If you have read this far you now know that blowing makes the air quality worse for you and your neighbors.\nFurthermore you can consider trying to switch to an “all electric” yard service company. Chevy Chase has made a list (I don’t know whether any of them service UP though…..). Gas-powered lawn mowers also use the same high pollution engine design.\nWe wore masks to make ourselves and our neighbors safer. We can make a similar gesture by reducing our gas yard tool usage.\nI DISAGREE, YOU MONSTER\nWell, email or call to me to let me know your opinion. I will say, as of today (June 19 2021), I have had approximately five “DO NOT PASS THIS” emails, one “I can deal with whatever the outcome”, and one “PLEASE PASS THIS” emails. And a whole bunch of informal “I don’t really care; this is boring me” conversations with random people.\n\n\n\n",
    "preview": "issues/2021-06-19-blowers/electric_blower.jpg",
    "last_modified": "2023-02-08T10:06:09-05:00",
    "input_file": {}
  },
  {
    "path": "issues/2021-06-09-westerngateway/",
    "title": "Western Gateway",
    "description": "Goodbye Trees",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2021-06-12",
    "categories": [
      "issues"
    ],
    "contents": "\nAugust 2021 Update\nAdding some relevant links. The next UP Developmental Overview Committee should be discussing this matter in more detail to formulate the town’s response.\nMore links:\nUMD\nGilbane (Developer)\nDiamondback\nMaryland Matters (1/2)\nMaryland Matters (2/2)\nSave Guilford Woods\nUP\nSite info:\nhttps://arsp.konveio.com/presentation-virtual-community-scenario-planning-workshop-meeting-june-3-2021\nScale:\n2600 units\n19,000 sq ft retail (the median grocery store is 40,000 alone)\n25,000 sq ft office\nGoals:\n“Maximize preservation of existing trees”\n“Encourage on-site/shared stormwater management systems.”\n“Create new passive/active open spaces, including a Neighborhood Amenity Square at the station”\n“Concentrate tallest buildings along Campus Drive/Mowatt Lane” (away from UP/CHE)\n“Expand bicycle/pedestrian/stormwater management/street trees along new & existing streets”\n“Recommend expansion of buffers from existing houses”\n“Reduce required and recommended parking to encourage walking/biking/transit use”\n“Implement a phasing plan: core to edges”\n“Understand Graduate Hills and St. Marks Church may not redevelop for 20+ years.”\n\n\n\nGood news\nThey will retain the trees around the stream in all plans\nThey, generally, propose townhouses (that are “stepped in” - one story on the CHE side) that abut CHE\nThe goals are laudable (“Maximize preservation of existing trees”, “on site stormwater”, “expand bicycle/pedestrian”)\nBad news\nNo discussion of stormwater management\nNo details on the tree preservation in the “passive parks.” Are they pruning trees? Will they cut some down? Will it literally be left alone?\nNo details on what the pedestrian / biking links will be. It’s a goal….but no information.\nLittle retail means you have to involve a car to get groceries\nNo intersection improvements at University / 193 / Adelphi. It’s already a nightmare and now a light rail and 4000 people are going to be added. I don’t know what the solution is, but do nothing doesn’t seem like a good idea.\nSchools were not mentioned….presumably some familes will be moving here?\nNo “active” recreation space (tennis courts, etc.)\nTown response\nWard 6 CM Martha Wells drafted a response that Mayor Carey sent to the Maryland-National Capital Park and Planning Commission. I have a copy of it, but have not seen the “formal” one posted on the UPMD.org page yet.\n\n\n\n",
    "preview": "issues/2021-06-09-westerngateway/three_proposal_maps.png",
    "last_modified": "2023-02-08T10:06:09-05:00",
    "input_file": {}
  },
  {
    "path": "notes/2021-05-20-signingup/",
    "title": "Hot off the press",
    "description": "Or how to influence the process",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2021-06-07",
    "categories": [
      "notes"
    ],
    "contents": "\nOur Town Clerk is Andrea. She told me she was hoping more town residents would sign up on the web page to get updates. I think she is right. Why should you? After all, the town writes and prints a newsletter that comes to your mailbox!\nWell - one important reason: time. The newsletter comes out once a month. Minutes of the town meetings that go into the newsletter have to be approved by the council. Then meet the printing cutoff. So essentially you are reading minutes (“what happened in the room”) that are 4-8 weeks old.\nIf you want to get council matter updates MUCH faster you can go here: https://www.upmd.org/list.aspx\nI suggest you sign up for the “Mayor’s Email List” as Mayor Carey generally sends out a Friday-before-the-Monday-Council-Meeting message that briefly covers what will be discussed at the upcoming meeting. There is always a public comment period near the start of the meeting (7:30 pm) to allow residents to have up to 3 minutes to give their opinion.\n\nIf you have more specific interests (for example “trees”) - you can sign up for Agenda updates for a specific committee like the “Trees, Parks, & Environment Committee”.\n If you want to influence legislation the best time to do it is at the Committee level. By the time a piece of legislation has made its way to the full Town Council the specific committee generally believes it is ready to be approved (otherwise why bother bringing it out?). So thus raising issues before it gets to the full Town Council will be more effective.\nRemember, all council meetings (either Committee or Council) are open to the public. You do not need to ask permission to show up. Depending on the specific Committee you can either take part in the full discussion or will be limited to speaking in the “public comment” portion of the meeting.\n\n\n\n",
    "preview": "notes/2021-05-20-signingup/mayor_list.png",
    "last_modified": "2023-02-08T10:06:09-05:00",
    "input_file": {}
  },
  {
    "path": "notes/2021-05-19-wheresthebridge/",
    "title": "Where's that bridge?",
    "description": "A sad story",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2021-05-19",
    "categories": [
      "notes"
    ],
    "contents": "\n2021-06-07\nHad a brief discussion with Mickey Beall (UP public works director).\nHere are my notes from our chat:\nThere is a new idea how to save money on the install (essentially drill a support instead of pouring a large foundation). But this would maybe save approximately $10,000 of the appoximately $100,000 install cost that we were last quoted. We also would have to restart the permitting process. It wouldn’t be as onerous this time. But still would take more time.\nAny new bridge has to be ADA compliant - so we can’t toss a narrow anything down.\nWe also can’t toss a bridge down like they do in the College Park metal dry ditch pedestrian bridges. Those would lift up and float away if it flooded. Which we know if a fairly likely scenario on Wells. Plus a stream with running water is a substantially more challenging environment for a bridge.\nLonger bridge won’t solve the problem either. The bridge would cost more and the installation cost would not change dramatically.\nBottom line: Mickey has spent 4+ years working on this and believes he has exhausted all angles. The cost is the cost. Essentially the council needs to decide: are these bridge(s) worth 100k each? Do we, as a town, find that a prudent use of our money? Is this something we value? Let me know what you think.\nOriginal post\nBrief stub to explain the current state of the Van Buren / Wells Parkway Pedestrian Bridge. Which Google Maps thinks is doing just fine.\n\nFrom my faulty memory, around 2016 it was pointed out that this bridge was in bad shape. This was confirmed by engineers. In fact, it was in such bad shape there was concern it could collapse. Thus, it was removed.\nPeriodically people (like me) ask “uh, where’s the replacement bridge?”\nHere, I will explain what I understand about this annoying situation.\nThe town bought two wooden bridges. We have them on hand.\nPermitting was required at three levels (Federal, State, and County). The latter was extremely challenging (apparently the bridges were missed in the 1990s era PG County Master Plan).\nAfter huge amounts of town staff time dealing with the three layers of permitting, the town bid the bridge install out. It came out substantially higher (around $110,000) than expected. The council, twice, voted it down.\nSo the bridge replacement process is currently … in bad shape. Maybe even dead.\nPart of the reason that the install was so expensive was the extensive amount of work required to not cause sediment and erosion issues in the stream bed.\nWith all we have learned, we may have to restart the entire process (including the part where we buy some bridges). A longer / larger bridge may cost more, but could save money on the install cost.\n\n\n\n",
    "preview": "notes/2021-05-19-wheresthebridge/google_maps_wells.png",
    "last_modified": "2023-02-08T10:06:09-05:00",
    "input_file": {}
  },
  {
    "path": "issues/2021-05-10-townhall/",
    "title": "Town Hall",
    "description": "Within our means",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2021-05-10",
    "categories": [
      "issues"
    ],
    "contents": "\nTown Hall\n\nUP’s Town Hall is not in great shape. Need to get a tour from Mr. Beall to see for myself. As I understand there is no ADA accessibility, mold issues, and insufficient space for the public works employees. The lot that the building is on is challenging to work with as it is not flat and the metro system has a tunnel running underneath it.\n2019\nThe town council in 2019 commissioned a town hall renovation study from Arnold & Arnold. You can read it here. The price is … a lot. 4.2 - 4.7 is more than our yearly budget. Now, that is not how things are paid for (UP would likely take out a 30 year bond), but still. That is a lot of money. My understanding is that the public works committee is essentially starting over on the project as the needs have changed with the pandemic.\n2009\nJohn Tabori mentioned to me that in 2009 he commissioned a town hall renovation report from Ahman. From his memory he thought it would have cost about 2.4 million. Which had to be shelved as the 2008 recession disappeared all of the grant money the town was expecting. I’m currently (2021-05-10) trying to get access to this study.\n… later that day …\nAndrea found the reports. Here and here are the two PDFs she tracked down.\nDramatically oversimplifying the two (2009 and 2019) studies, I would say that the scope increased from 2009 to 2019. The 2009 plan essentially leaves the original building layout the same (but presumably fixed it up?), builds a small “transition” section whose purpose is to 1. hold an elevator to reach the second floor of the original Town Hall and 2. connect to the new building. The new building is a one story structure that holds a 1. large meeting room, 2. two offices, and 3. a kitchen.\nThe 2019 plan involves two new buildings. Obviously costs from 2009 won’t match 2019, but the extra building (and increased footprint) very roughly increases the building cost by one million and the property grading work by another million. Hence 2009 is approximately $2.3 and 2019 is approximately $4.5 million.\n2019 Concept 1, Option A\n\n2009\n\n\n(There’s no equivalent to the image above in the 2019 study)\n\n\n\n",
    "preview": "issues/2021-05-10-townhall/townhall_report_screenshot.jpg",
    "last_modified": "2023-02-08T10:06:09-05:00",
    "input_file": {}
  },
  {
    "path": "issues/2021-05-05-storm-water-management/",
    "title": "Storm Water Management",
    "description": "A running topic",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2021-05-05",
    "categories": [
      "issues"
    ],
    "contents": "\nNote\nSee the bottom of this post for updates\nWard 5 Flooding “Hot Spots”\nWard 5 floods periodically. Not in the “traditional” sense, but because occasionally it rains so hard that the storm drain system cannot keep up. The problem spot is roughly between Pineway (at Clagett-Pineway) through the empty lot near 6924 Pineway, where it heads towards Guilford Run\nFloodfactor.com\n\nPerspective\nWhile this nice map shows us where the issues are in Ward 5, the surrounding region has FAR WORSE problems (e.g. Riverdale Park below Whole Foods and lower/east Calvert Hills)\n\nUP Role - April 2021\nFrom a conversation with Len Carey in April 2021, I learned that UP had recently discovered that some of the storm water piping was substandard and not under the control of PG County. Should the town be able to upgrade the piping, then responsibility of the storm drains can be transferred (town wide?) to PG County See the image below for the approximate location of the substandard piping. The storm drain here (Pineway at Clagett-Pineway) regularly drains very slowly under heavy rains. I would imagine that fixing the pipe here would fix this issue.\n\nDownstream\nFrom my own experience, under VERY (as in 2+ inches/hour) heavy rain events, Guilford Run can get backed up and the storm drains stop taking in water (or perhaps even go backwards….). This is likely because the pipe underneath Baltimore isn’t large enough. For the Ward 5 storm flooding issues to be aleviated, this also would need to be addressed (I assume with a Guilford Run holding tank and/or better flow underneath Route 1).\n2021 05 Update\nThanks for Carter for pointing this document / plan out. There has been a great deal of planning to deal with Guilford Run -> Calvert Hills already. With a fair amount of money spent, according to this document. However, the bulk of the project remains to be done.\n\nI’m not certain at what level (College Park / PG County / Higher?) this is being run at. I also need to figure out what the current status of the project is. Should “they” move this more to completion, it would benefit the Pineway/Ward 5 stretch.\n2021-06-07 Update\nSome new comments after talking with UP Public Works Director Mickey Beall.\nThe town owns seven sections of storm drains. Mickey does not want to own them. He recently had to spend $1800 to unplug one. His budget is not sufficiently flush enough to withstand too many of these surprises. No more sanitation puns I promise.\nIf we can bring the storm drains up to PG County (not WSSC, I was wrong) standard, we can give them over and then it is their problem. Bad news, is that this requires a lot of planning, permitting, and destruction / construction. Good news is that Mickey has already started on the planning and the costs will be 100% reimbursed by the county after we complete the updates.\nThe town will continue to flood until improvements are made outside our town. When 9 Ponds is done (within a couple of years?) this alone will reduce the Wells Run flood level by several inches.\nIn Ward 5, Mickey confirmed our flooding is caused by Guilford Run backing up. Mickey said that Pineway at Clagett-Pineway is only about a foot higher than Guilford. So we need the Calvert Hill project to be implemented. Mickey said he thought they were supposed to start this summer. Emphasis on supposed to.\nBottom line - anyone who has flooded in the near term should expect a repeat\n\n\n\n",
    "preview": "issues/2021-05-05-storm-water-management/flood_factor_pineway_annotated.png",
    "last_modified": "2023-02-08T10:06:09-05:00",
    "input_file": {}
  },
  {
    "path": "notes/2021-05-05-upmd-website-content/",
    "title": "UP Website Content",
    "description": "How to benefit from the UP website content",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2021-05-05",
    "categories": [
      "notes"
    ],
    "contents": "\nThe upmd.org web page is a great resource for getting a wide variety of town info. There is an extensive amount of public discourse about what the town is doing, will do, and would like to do. This happens at the town meetings.\nImportantly, the notes for the meetings are TEXT SEARCHABLE.\nThe town meetings are of two basic types: town council (1st and 3rd Mondays of each month, beginning at 7:30pm) and committees (each with their own schedule, often monthly). All of these meetings are fully open to the public and as of May 2021 are held exclusively via zoom teleconference.\nA case study\nTo give an example of how to search the town web page to find information on what the town is doing, we will search the term “storm water.”\n\n In the search box you can put in a word or phrase (“storm water”). Then click the magnifying glass (or hit “return” on the keyboard) and you will get the time sorted results, split by section (where section is the specific committee or the town council).\n We see the top three hits (by date) are in the Town Council Meeting and the Development Overview Committee. You can then download either the Agenda (what will be discussed) or the Minutes (a summary of what was discussed).\nIf we download the Mar 11, 2021 minutes we see that the “Aspen, College Park” development has a preliminary plan of subdivision that has been approved and “Nick Speech talked about the re-engineering of the project’s stormwater handling. The County will not accept a fee in-lieu for stormwater management. They have included vaults to hold stormwater under each of the 2 buildings…”\n\n\n\n",
    "preview": "notes/2021-05-05-upmd-website-content/upmd_page.png",
    "last_modified": "2023-02-08T10:06:09-05:00",
    "input_file": {}
  }
]
