[
  {
    "path": "issues/2021-06-19-blowers/",
    "title": "Blowers",
    "description": "Full of air",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2021-06-19",
    "categories": [
      "issues"
    ],
    "contents": "\nIssue\nThe UP Town Council will soon (July 2021 or so) vote on whether to ban gas-powered leaf blowers as of January 1, 2023.\nMy position\nLean no (as of June 19 2021)\nSome background reading\nUP Policy, Rules, and Municipal Structure Committee statement: here\nAtlantic article on how and why DC banned gas-powered leaf blowers as of 2022: here\nDCist update on DC residents trying to push up the ban date: here\nWashington University post that briefly summarizes the air pollution impact (on all gas-powered yard equipment, not just blowers): here. “A 2011 study showed that a leaf blower emits nearly 300 times the amount of air pollutants as a pickup truck. Similarly, a 2001 study showed that one hour using a gas-powered lawn mower is equivalent to driving a car 100 miles.”\nThe resolution\nRead it here.\nThe relevant line is “BEGINNING JANUARY 1, 2023, IT SHALL BE UNLAWFUL FOR ANY OWNER OR OCCUPANT OF REAL PROPERTY LOCATED WITHIN THE TOWN, OR ANY GUEST, EMPLOYEE OR CONTRACTOR OF SUCH PERSON, TO USE A GAS- POWERED LEAF BLOWER ON THAT PROPERTY.”\nPros for banning gas powered leaf blowers:\nGas-powered leaf blowers emit SUBSTANTIAL air pollution. Electric does not. Pollution is produced by electricity creation of course, but it is from an emissions-controlled power plant very far away. Essentially gas-powered blowers make the air worse for you and your neighbors, some of which suffer from respiratory issues.\nGas-powered leaf blowers emit SUBSTANTIAL noise pollution. You all know. You can hear it. From my brief Googling: gas blowers (at 50 feet) emit around 80-90db (which is in the “damages your ears” range) and comparable electric blowers emit around 60-70db (which is in the “maybe annoying” range).\nCons for banning:\nIn the short term, it will likely drive up cost of contractor yard maintenance.\nIn the short term, contractors may refuse to work in UP\nMy longer position\nPersonally, I think this should pass as written. But….I’m young (or middle-aged depending on your perspective), hand-rake my yard, and don’t usually pay contractors to do yard work. I understand many people do rely on contractors to keep their yard maintained. Our town has a lot of trees and a lot of leaves. It needs to be feasible for contractors to swap over to electric for the blowers by 2023. This I am unsure about.\nIf I could see some evidence / persuasive anecdotes that banning gas powered blowers would moderately (or less) drive up costs of leaf removal, then I would lean toward voting “yes.” I am just concerned that switching to electric blowers is not practical in the next 18 months. My brief Googling does not find many “contractor” grade blowers.\nWhat should I do as a neighbor and a member of a community right now?\nAsk your contractor right now to reduce (or even stop) the amount of blowing done in your yard. It seems like the “default” position of yard contractors is to spend 10+ minutes walking around blowing grass clippings around year-round. This is not necessary (unless the aesthetics are very important to you). If you have read this far you now know that blowing makes the air quality worse for you and your neighbors.\nFurthermore you can consider trying to switch to an “all electric” yard service company. Chevy Chase has made a list (I don’t know whether any of them service UP though…..). Gas-powered lawn mowers also use the same high pollution engine design.\nWe wore masks to make ourselves and our neighbors safer. We can make a similar gesture by reducing our gas yard tool usage.\nI DISAGREE, YOU MONSTER\nWell, email or call to me to let me know your opinion. I will say, as of today (June 19 2021), I have had approximately five “DO NOT PASS THIS” emails, one “I can deal with whatever the outcome”, and one “PLEASE PASS THIS” emails. And a whole bunch of informal “I don’t really care; this is boring me” conversations with random people.\n\n\n\n",
    "preview": "issues/2021-06-19-blowers/electric_blower.jpg",
    "last_modified": "2021-06-19T13:17:48-04:00",
    "input_file": {}
  },
  {
    "path": "issues/2021-06-09-westerngateway/",
    "title": "Western Gateway",
    "description": "Goodbye Trees",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2021-06-12",
    "categories": [
      "issues"
    ],
    "contents": "\nSite info:\nhttps://arsp.konveio.com/presentation-virtual-community-scenario-planning-workshop-meeting-june-3-2021\nScale:\n2600 units\n19,000 sq ft retail (the median grocery store is 40,000 alone)\n25,000 sq ft office\nGoals:\n“Maximize preservation of existing trees”\n“Encourage on-site/shared stormwater management systems.”\n“Create new passive/active open spaces, including a Neighborhood Amenity Square at the station”\n“Concentrate tallest buildings along Campus Drive/Mowatt Lane” (away from UP/CHE)\n“Expand bicycle/pedestrian/stormwater management/street trees along new & existing streets”\n“Recommend expansion of buffers from existing houses”\n“Reduce required and recommended parking to encourage walking/biking/transit use”\n“Implement a phasing plan: core to edges”\n“Understand Graduate Hills and St. Marks Church may not redevelop for 20+ years.”\n\n\n\nGood news\nThey will retain the trees around the stream in all plans\nThey, generally, propose townhouses (that are “stepped in” - one story on the CHE side) that abut CHE\nThe goals are laudable (“Maximize preservation of existing trees”, “on site stormwater”, “expand bicycle/pedestrian”)\nBad news\nNo discussion of stormwater management\nNo details on the tree preservation in the “passive parks.” Are they pruning trees? Will they cut some down? Will it literally be left alone?\nNo details on what the pedestrian / biking links will be. It’s a goal….but no information.\nLittle retail means you have to involve a car to get groceries\nNo intersection improvements at University / 193 / Adelphi. It’s already a nightmare and now a light rail and 4000 people are going to be added. I don’t know what the solution is, but do nothing doesn’t seem like a good idea.\nSchools were not mentioned….presuambly some familes will be moving here?\nNo “active” recreation space (tennis courts, etc.)\nTown response\nWard 6 CM Martha Wells drafted a response that Mayor Carey sent to the Maryland-National Capital Park and Planning Commission. I have a copy of it, but have not seen the “formal” one posted on the UPMD.org page yet.\n\n\n\n",
    "preview": "issues/2021-06-09-westerngateway/three_proposal_maps.png",
    "last_modified": "2021-06-19T13:17:41-04:00",
    "input_file": {}
  },
  {
    "path": "issues/2021-05-10-townhall/",
    "title": "Town Hall",
    "description": "Within our means",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2021-05-10",
    "categories": [
      "issues"
    ],
    "contents": "\nTown Hall\n\nUP’s Town Hall is not in great shape. Need to get a tour from Mr. Beall to see for myself. As I understand there is no ADA accessibility, mold issues, and insufficient space for the public works employees. The lot that the building is on is challenging to work with as it is not flat and the metro system has a tunnel running underneath it.\n2019\nThe town council in 2019 commissioned a town hall renovation study from Arnold & Arnold. You can read it here. The price is … a lot. 4.2 - 4.7 is more than our yearly budget. Now, that is not how things are paid for (UP would likely take out a 30 year bond), but still. That is a lot of money. My understanding is that the public works committee is essentially starting over on the project as the needs have changed with the pandemic.\n2009\nJohn Tabori mentioned to me that in 2009 he commissioned a town hall renovation report from Ahman. From his memory he thought it would have cost about 2.4 million. Which had to be shelved as the 2008 recession disappeared all of the grant money the town was expecting. I’m currently (2021-05-10) trying to get access to this study.\n… later that day …\nAndrea found the reports. Here and here are the two PDFs she tracked down.\nDramatically oversimplifying the two (2009 and 2019) studies, I would say that the scope increased from 2009 to 2019. The 2009 plan essentially leaves the original building layout the same (but presumably fixed it up?), builds a small “transition” section whose purpose is to 1. hold an elevator to reach the second floor of the original Town Hall and 2. connect to the new building. The new building is a one story structure that holds a 1. large meeting room, 2. two offices, and 3. a kitchen.\nThe 2019 plan involves two new buildings. Obviously costs from 2009 won’t match 2019, but the extra building (and increased footprint) very roughly increases the building cost by one million and the property grading work by another million. Hence 2009 is approximately $2.3 and 2019 is approximately $4.5 million.\n2019 Concept 1, Option A\n\n2009\n\n\n(There’s no equivalent to the image above in the 2019 study)\n\n\n\n",
    "preview": "issues/2021-05-10-townhall/townhall_report_screenshot.jpg",
    "last_modified": "2021-05-10T16:19:16-04:00",
    "input_file": {}
  },
  {
    "path": "issues/2021-05-05-storm-water-management/",
    "title": "Storm Water Management",
    "description": "A running topic",
    "author": [
      {
        "name": "David McGaughey",
        "url": {}
      }
    ],
    "date": "2021-05-05",
    "categories": [
      "issues"
    ],
    "contents": "\nNote\nSee the bottom of this post for updates\nWard 5 Flooding “Hot Spots”\nWard 5 floods periodically. Not in the “traditional” sense, but because occasionally it rains so hard that the storm drain system cannot keep up. The problem spot is roughly between Pineway (at Clagett-Pineway) through the empty lot near 6924 Pineway, where it heads towards Guilford Run\nFloodfactor.com\n\nPerspective\nWhile this nice map shows us where the issues are in Ward 5, the surrounding region has FAR WORSE problems (e.g. Riverdale Park below Whole Foods and lower/east Calvert Hills)\n\nUP Role - April 2021\nFrom a conversation with Len Carey in April 2021, I learned that UP had recently discovered that some of the storm water piping was substandard and not under the control of PG County. Should the town be able to upgrade the piping, then responsibility of the storm drains can be transferred (town wide?) to PG County See the image below for the approximate location of the substandard piping. The storm drain here (Pineway at Clagett-Pineway) regularly drains very slowly under heavy rains. I would imagine that fixing the pipe here would fix this issue.\n\nDownstream\nFrom my own experience, under VERY (as in 2+ inches/hour) heavy rain events, Guilford Run can get backed up and the storm drains stop taking in water (or perhaps even go backwards….). This is likely because the pipe underneath Baltimore isn’t large enough. For the Ward 5 storm flooding issues to be aleviated, this also would need to be addressed (I assume with a Guilford Run holding tank and/or better flow underneath Route 1).\n2021 05 Update\nThanks for Carter for pointing this document / plan out. There has been a great deal of planning to deal with Guilford Run -> Calvert Hills already. With a fair amount of money spent, according to this document. However, the bulk of the project remains to be done.\n\nI’m not certain at what level (College Park / PG County / Higher?) this is being run at. I also need to figure out what the current status of the project is. Should “they” move this more to completion, it would benefit the Pineway/Ward 5 stretch.\n2021-06-07 Update\nSome new comments after talking with UP Public Works Director Mickey Beall.\nThe town owns seven sections of storm drains. Mickey does not want to own them. He recently had to spend $1800 to unplug one. His budget is not sufficiently flush enough to withstand too many of these surprises. No more sanitation puns I promise.\nIf we can bring the storm drains up to PG County (not WSSC, I was wrong) standard, we can give them over and then it is their problem. Bad news, is that this requires a lot of planning, permitting, and destruction / construction. Good news is that Mickey has already started on the planning and the costs will be 100% reimbursed by the county after we complete the updates.\nThe town will continue to flood until improvements are made outside our town. When 9 Ponds is done (within a couple of years?) this alone will reduce the Wells Run flood level by several inches.\nIn Ward 5, Mickey confirmed our flooding is caused by Guilford Run backing up. Mickey said that Pineway at Clagett-Pineway is only about a foot higher than Guilford. So we need the Calvert Hill project to be implemented. Mickey said he thought they were supposed to start this summer. Emphasis on supposed to.\nBottom line - anyone who has flooded in the near term should expect a repeat\n\n\n\n",
    "preview": "issues/2021-05-05-storm-water-management/flood_factor_pineway_annotated.png",
    "last_modified": "2021-06-07T16:49:52-04:00",
    "input_file": {}
  }
]
